{
  "Index": {
    "Header": {
      "link": "#",
      "digitalAgency": "digital agency",
      "navLinks": {
        "Services": "#our-help",
        "Cases": "#our-cases",
        "Benefits of RoR": "#advantages-ror",
        "About Us": "#about-us"
      },
      "messageUs": "Message on Telegram",
      "projectImplement": "Project implementation in 1 month!",
      "title": "Fast development of your<break></break> idea on Ruby on Rails",
      "adaptiveTitle": "Fast<break></break> development<break></break> of your idea<break></break>  on Ruby on Rails",
      "mdTitle": "Fast development<break></break> of your idea on Ruby<break></break>on Rails",
      "description": "During a free consultation,<break></break> you'll receive an analysis of potential<break></break> and a roadmap for a successful launch",
      "adaptiveDescription": "During a free consultation, you'll receive an analysis of<break></break> potential and a roadmap for a successful launch",
      "mdDescription": "During a free consultation, you'll receive an analysis<break></break>of potential and a roadmap for a successful launch",
      "desktopDescription": "During a free consultation, you'll receive an analysis<break></break>of potential and a roadmap for a successful launch",
      "consultationBtn": "Get a Free Consultation "
    },
    "OurHelp": {
      "link": "our-help",
      "title": "How we can assist you",
      "adaptiveTitle": "Services",
      "lgTitle": "How we can <break></break>assist you",
      "filters": {
        "Project Activities": {
          "Web Project Development": {
            "description": "Creating high-quality and scalable web applications using the powerful and flexible framework — Ruby on Rails",
            "price": "10 000"
          },
          "Business Application Development": {
            "description": "Applications for optimizing business processes and increasing company efficiency",
            "price": "50 000"
          },
          "Code Audit": {
            "description": "Analysis and evaluation of your current project for: code quality, security, scalability, and performance",
            "price": "700"
          },
          "Integration with External Systems": {
            "description": "Creating compatible and interconnected applications that interact with various external services and APIs",
            "price": "10 000"
          },
          "E-commerce Systems Development": {
            "description": "Creating flexible solutions capable of handling and processing large volumes of transactions",
            "price": "100 000"
          },
          "Upgrading and Evolving Existing Applications": {
            "description": "From making adjustments to existing code to creating a new module from scratch",
            "price": "45 per hour"
          }
        },
        "OUTSTAFFING": {
          "SENIOR ROR РАЗРАБОТЧИК (ROR, PostgreSQL, MySQL, Vue.js)": {
            "description": "Leads projects, designs architecture; Makes key technical decisions; Provides mentorship, explores new technologies",
            "price": "75 per hour"
          },
          "Middle разработчик": {
            "description": "Works independently, manages projects; Solves problems, optimizes processes; Mentors junior developers",
            "price": "55 per hour"
          },
          "Junior+ Developer": {
            "description": "Completes tasks under supervision; Participates in training and development; Writes code, debugs issues",
            "price": "35 per hour"
          },
          "Chief Technical Officer (CTO)": {
            "description": "Develops and implements the company's strategic technical plans; Introduces new technologies to maintain product competitiveness; Leads engineering teams",
            "price": "130 per hour"
          },
          "Project Manager": {
            "description": "Develops project plans considering resources, timelines, and budget; Manages teams to achieve objectives; Ensures adherence to deadlines and budget constraints, minimizes risks",
            "price": "80 per hour"
          },
          "Team lead": {
            "description": "Coordinates and supports team operations; Defines technical solutions and standards; Develops the team's professional skills; Ensures adherence to development processes and task deadlines",
            "price": "80 per hour"
          },
          "DEVOPS": {
            "description": "Develops and implements automation; Sets up CI/CD to enhance code quality and release speed; Configures performance monitoring",
            "price": "60 per hour"
          },
          "QA Engineer": {
            "description": "Tests products to ensure compliance with requirements; Identifies and documents bugs; Develops test plans and scenarios",
            "price": "35 per hour"
          }
        }
      },
      "from": "from"
    },
    "OurCases": {
      "link": "our-cases",
      "title": "OUR CASES",
      "description": "Our projects are the best proof of our expertise",
      "responsiveDescription": "Our projects are the best proof of our expertise",
      "cases": {
        "portal dominion capital": {
          "img": "dominio-cap.png",
          "description": "Comprehensive CRM system for optimizing internal processes of the organization for providing loans in the United States of America.",
          "goal": "The creation of a comprehensive CRM system for optimizing internal processes for providing loans in the United States of America, including the improvement of project management processes related to the creation and approval of terminology sheets, as well as enhancing functionality and user experience for more effective management of deals and credit lines.",
          "fullDescription": "<yellowHeader>Enhancing the Deal Workflow:</yellowHeader><whiteHeader>Dynamic Dropdown Link:</whiteHeader><break></break><paragraph>The link dynamically adapts based on the project stage, ensuring intuitive navigation for users.</paragraph><whiteHeader>Streamlined Creation and Approval:</whiteHeader><paragraph>The system creates a TermSheetApproval if it doesn't already exist. Additionally, approval processes are seamlessly managed, ensuring that TermSheetApproval progresses only when required conditions are met.</paragraph><whiteHeader>Document Management:</whiteHeader><paragraph>The system allows for downloading and uploading Term Sheets in various scenarios, ensuring a comprehensive repository for crucial documents.</paragraph><whiteHeader>Enhanced User Experience:</whiteHeader><paragraph>The user interface is designed to facilitate efficient workflows. For instance, the WireInfos selector is available when dealing with syndicates, simplifying decision-making.</paragraph><whiteHeader>Stimulus Integration:</whiteHeader><paragraph>Our system leverages the power of Stimulus controllers to enable specific actions at different stages, enhancing both user experience and document generation.</paragraph><whiteHeader>Audits and Notifications:</whiteHeader><paragraph>All stages of TermSheetApproval are equipped with an Audits table, providing an overview of activities. CustomAudits are intelligently generated and managed, keeping stakeholders informed.</paragraph><whiteHeader>Role-based Workflow:</whiteHeader><paragraph>User roles play a significant role in the process. Approvers and stakeholders are seamlessly integrated into the workflow, ensuring that the right individuals are involved at the right time.</paragraph><whiteHeader>Seamless Slack Integration:</whiteHeader><paragraph>The final stages of approval involve automatic Term Sheet download and submission to Slack, all managed through the system's frontend.</paragraph><yellowMarginHeader>Unveiling the Results</yellowMarginHeader><paragraph>Our team's dedication and expertise culminated in the successful completion of Task #1756 in just 87 hours and 54 minutes. Throughout the process, 64 files were updated, resulting in an impressive codebase transformation: +2733 additions and -819 deletions.</paragraph>",
          "link": ""
        },
        "Portraits of honor": {
          "img": "portraits-of-honor.png",
          "description": "Holocaust Survivors from Michigan is an interactive educational exhibit of the Program for Holocaust Survivors and their Families.",
          "goal": "The creation of an interactive educational exhibit dedicated to Holocaust survivors from Michigan, as part of the Program for Holocaust Survivors and their families, with the goal of preserving historical memory, educating future generations, and supporting survivors and their families.",
          "fullDescription": "",
          "link": "https://www.portraitsofhonor.org/"
        },
        "Loandox": {
          "img": "loandox.png",
          "description": "CRM system for Gu Loans, which provides loan services for various types of businesses.",
          "goal": "It was necessary to improve the existing CRM system for Gu Loans, which provides loan services for various types of businesses.The tasks on the client side include: 1.Development of an HTML email that the client receives after submitting an application on the website 2.Development of a document upload form 3.Development of modal windows",
          "link": "https://www.behance.net/gallery/154321453/CRM-system-for-GU-Loans"
        },
        "The Oleh Budget Calculator": {
          "img": "calculator.png",
          "description": "Development of an application for calculating and analyzing the cost of living, including transportation expenses, with dynamic visualization features and integration of real-time data.",
          "goal": "Creation of a cost of living calculator for moving to Israel, with integration of real prices and expense databases of various cities in the country.",
          "fullDescription": "<yellowHeader>Detailed Cost of Living Calculation:</yellowHeader><whiteHeader></whiteHeader><paragraph>Users can enter and customize various expenses such as housing, utilities, food, entertainment, healthcare, and more.</paragraph><paragraph>The application calculates the total monthly and annual cost of living based on the entered data.</paragraph><paragraph>A database of average expenses for different cities in Israel is supported for accurate calculations.</paragraph><whiteHeader>Transportation Component:</whiteHeader><paragraph>A separate section for transportation expenses, including options for public transportation and personal vehicle expenses.</paragraph><paragraph>Users can enter data about daily trips, type of vehicle, fuel consumption, and public transportation usage.</paragraph><paragraph>Integration with real-time traffic data and fuel prices for accurate expense calculations.</paragraph><whiteHeader>Dynamic Visualization:</whiteHeader><paragraph>Detailed charts and graphs to visually represent the expense structure.</paragraph><paragraph>An interactive chart that updates in real-time as users change the data.</paragraph><paragraph>Comparison tools that allow users to see how various changes affect the overall budget.</paragraph><whiteHeader>Currency Exchange Service:</whiteHeader><paragraph>A separate service for retrieving and updating currency exchange rates in real-time.</paragraph><paragraph>Users can enter expenses in different currencies, and the application automatically converts them using the latest exchange rate.</paragraph><paragraph>The service ensures accuracy and currency of the calculations.</paragraph><whiteHeader>Real-time Calculation:</whiteHeader><paragraph>As users enter or change expenses, the application instantly recalculates the total cost of living and updates the visual charts.</paragraph><paragraph>Instant feedback helps users understand the financial implications of their choices without delay.</paragraph>",
          "link": ""
        }
      },
      "goalText": "Goal",
      "learnMore": "View the entire case",
      "orderLink": "Order Project "
    },
    "RoRAdvantages": {
      "link": "ror-advantages",
      "title": "Benefits of Ruby on Rails",
      "advantages": {
        "SPEED of implementation": "Ruby on Rails allows us to significantly speed up the development process and turn ideas into functioning products, thanks to ready-made solutions for many tasks combined with our flexible methodologies, enabling us to launch your project faster than ever",
        "Database support": "Supports integration with widely-used database management systems like MySQL, PostgreSQL, and others, making it a versatile development solution",
        "Flexible Source Code": "The framework allows for code customization to meet your needs. It adapts flexibly to various types of applications required by businesses"
      }
    },
    "OurApproach": {
      "title": "Our Approach to Work",
      "approaches": {
        "Effective Management": "We use a version control system (Git) and provide access to our repository on platforms like GitHub or GitLab upon client request",
        "Transparency in Work": "Using CI, Capistrano, and continuous deployment to a staging server keeps you fully informed about your project’s development process",
        "Code Coverage for Projects": "We ensure complete code coverage of our projects with automated tests using Rspec, Capybara, and Factorybot",
        "Monitoring and Optimization": "We perform error monitoring and resolution using Sentry and carry out performance monitoring and optimization using New Relic"
      }
    },
    "AboutUs": {
      "link": "about-us",
      "title": "about our company",
      "description": "Future Markt is a digital agency that was founded in 2011. We create decentralized applications and their interfaces, develop UX/UI designs, and marketing strategies to promote projects online",
      "responsiveDescription": "Future Markt is a digital agency that was founded in 2011. We create decentralized applications and their interfaces, develop UX/UI designs, and marketing strategies to promote projects online",
      "advantages": {
        "15 years with Ruby on Rails": "Since 2009, we have been actively developing projects on Ruby on Rails, continuously expanding our experience and expertise",
        "58 projects with RoR": "We have accumulated significant experience in developing web applications, enabling us to launch your project with minimal risks and errors",
        "Complex tasks made easy": "We solve tasks of any complexity, including API development, large web application development, integration with external systems, and more"
      },
      "haveIdea": "Have an idea?",
      "sayToUs": "Tell us about it, and we’ll bring it to life with Ruby on Rails",
      "contactOnTG": "Contact on Telegram:",
      "contacts": {
        "Yaroslav": {
          "post": "CMO",
          "link": "https://t.me/yarkoch"
        },
        "Vitaly": {
          "post": "product manager",
          "link": "https://t.me/vitkoz"
        }
      }
    },
    "OtherServices": {
      "title": "Our Other Services",
      "services": {
        "Web3 Project Development": {
          "desc": "Development of DeFi, DAO, dApp, Smart Contracts, Advising and Consulting, Token/Cryptocurrency Development",
          "link": "https://web3.futuremarkt.com/"
        },
        "Web Design": {
          "desc": "Development of landing pages, e-commerce sites, corporate websites, brand books, UX/UI interfaces",
          "link": "#"
        }
      },
      "knowMore": "Learn More"
    },
    "WeInMedia": {
      "link": "we-in-media",
      "title": "We in the Media",
      "articles": {
        "Powerful Framework for Creating Ruby APIs": {
          "img": "grape",
          "description": "If you're involved in web application or API development, you've probably heard of Grape — a powerful framework in the Ruby programming language",
          "link": "https://teletype.in/@yegordv/WBkP1wGDHoc"
        },
        "Chatbot Development Using Ruby": {
          "img": "robot",
          "description": "Ruby makes chatbot development quick and easy. In this article, we will explore the advantages of Ruby for chatbot development with code examples",
          "link": "https://tproger.ru/articles/razrabotka-chat-botov-s-ispolzovaniem-ruby"
        }
      },
      "videoLink": "#",
      "readMore": "Read More"
    },
    "HaveQuestions": {
      "title": "Any questions?",
      "leaveReq": "Submit a request or message us on Telegram, and our specialists will contact you and answer any questions you may have",
      "writeTGBtn": "Message on Telegram",
      "leaveReqLink": "Submit a Request"
    },
    "Footer": {
      "digitalAgency": "digital agency",
      "copyright": "© future markt",
      "legalEntityInfo": "Information about the Legal Entity",
      "privacy": "Privacy Policy",
      "forAllQuestions": "For all inquiries:",
      "@yarkoch": "+7 (999) 136-68-38",
      "rights": "All rights reserved",
      "upBtn": "UP",
      "addresses": {
        "+7 999 136 6838": "Russia, Nizhny Novgorod, Rodionova 192B",
        "+972 54 9965034": "Israel 90435, Zeit Shemen St 2 Efrat",
        "+1 414 212 5484": "United States of America, Continure, 1366 E Sumner St #1008, Hartford WI 53027"
      }
    }
  }
}
