{
  "Index": {
    "Header": {
      "link": "#",
      "digitalAgency": "digital agency",
      "navLinks": {
        "Services": "#our-help",
        "Cases": "#our-cases",
        "Benefits of RoR": "#advantages-ror",
        "About Us": "#about-us"
      },
      "messageUs": "Message on Telegram",
      "projectImplement": "Project implementation in 1 month",
      "title": "Fast development of your<break></break> idea on Ruby on Rails",
      "adaptiveTitle": "Fast<break></break> development<break></break> of your idea<break></break>  on Ruby on Rails",
      "mdTitle": "Fast development<break></break> of your idea on Ruby<break></break>on Rails",
      "description": "During a free consultation,<break></break> you'll receive an analysis of potential<break></break> and a roadmap for a successful launch",
      "adaptiveDescription": "During a free consultation, you'll receive an analysis of<break></break> potential and a roadmap for a successful launch",
      "mdDescription": "During a free consultation, you'll receive an analysis<break></break>of potential and a roadmap for a successful launch",
      "desktopDescription": "During a free consultation, you'll receive an analysis<break></break>of potential and a roadmap for a successful launch",
      "consultationBtn": "Get a Free Consultation "
    },
    "OurHelp": {
      "link": "our-help",
      "title": "How we can assist you",
      "adaptiveTitle": "Services",
      "lgTitle": "How we can <break></break>assist you",
      "messageUs": "Message on Telegram",
      "filters": {
        "Project Activities": {
          "Web Project Development": {
            "description": "Creating high-quality and scalable web applications using the powerful and flexible framework — Ruby on Rails",
            "price": "10 000",
            "fullDescription": "<mainTitle>Web Project Development</mainTitle><paragraph>We will create a web project using Ruby on Rails.</paragraph><listTitle>What are the advantages of this development?</listTitle><list><listLine>Development speed: Ruby on Rails offers developers the ability to quickly develop and deploy web applications.</listLine><listLine>Code quality: Rails encourages the use of best programming practices, such as the MVC (Model-View-Controller) architecture, which makes the code more organized and maintainable.</listLine><listLine>Flexibility and scalability: Rails allows you to easily modify and scale web applications as the business grows.</listLine><listLine>Security: Ruby on Rails includes many built-in security mechanisms that help protect web applications from common vulnerabilities such as SQL injections, XSS, and CSRF. This is especially important for web projects dealing with sensitive data.</listLine><listLine>Cost savings: Due to the high development speed and code quality, Ruby on Rails projects often require a smaller budget for development and maintenance compared to other technologies. This allows businesses to save resources and allocate them to other important tasks.</listLine></list>"
          },
          "Business Application Development": {
            "description": "Applications for optimizing business processes and increasing company efficiency",
            "price": "50 000",
            "fullDescription": "<mainTitle>Business Application Development</mainTitle><paragraph>Business applications are software solutions specifically designed to automate, optimize, and manage business processes within a company.</paragraph><listTitle>Why is this necessary?</listTitle><list><listLine>Process automation: Business applications allow for the automation of routine and repetitive tasks, freeing up employees to perform more complex tasks.</listLine><listLine>Increased efficiency: Using specialized business applications helps improve coordination between different departments of the company, simplifies information exchange, and speeds up decision-making.</listLine><listLine>Data accuracy and reliability: Business applications allow for the collection, storage, and analysis of large volumes of data with a high degree of accuracy. This minimizes the likelihood of errors and enables informed decision-making based on accurate data.</listLine><listLine>Improved customer service: Business applications, such as CRM systems, help better manage customer relationships, track their needs and preferences, and provide more personalized service.</listLine><listLine>Scalability and flexibility: Modern business applications are easily scalable and adaptable to the changing needs of the company. This allows the company to grow and develop without significant changes in the technologies used.</listLine><listLine>Security and confidentiality: Business applications include modern data protection mechanisms, which are especially important for companies working with confidential information. This helps protect the business from cyber threats and comply with data protection regulations.</listLine></list>"
          },
          "Code Audit": {
            "description": "Analysis and evaluation of your current project for: code quality, security, scalability, and performance",
            "price": "700",
            "fullDescription": "<mainTitle>Code Audit</mainTitle><paragraph>Code audit is a thorough analysis of the source code of your software to identify errors, vulnerabilities, inefficient areas, and non-compliance with best development practices.</paragraph><listTitle>Why is this necessary?</listTitle><list><listLine>Ensuring code quality: Audit helps detect and fix errors and bugs in the code, improving the overall quality of the software and reducing the likelihood of future failures and errors.</listLine><listLine>Improving performance: Audit identifies inefficient areas of the code that may slow down the application. Optimizing these areas improves the performance and speed of the software.</listLine><listLine>Compliance with standards and best practices: Code audit checks the code for compliance with established standards and best development practices. This ensures ease of maintenance and further development of the project.</listLine><listLine>Reducing technical debt: Regular code audits help reduce technical debt that can accumulate in a project due to the use of outdated solutions or temporary \"patches\".</listLine><listLine>Documenting and understanding the code: Audit helps better understand the structure and logic of the code, making it easier to document and transfer to other developers. This is especially important for large projects and teamwork.</listLine></list>"
          },
          "Integration with External Systems": {
            "description": "Creating compatible and interconnected applications that interact with various external services and APIs",
            "price": "10 000",
            "fullDescription": "<mainTitle>Integration with External Systems</mainTitle><paragraph>Integration with external systems involves the process of combining your software with other applications, services, or platforms. This allows you to automate business processes, improve data exchange, and expand the functionality of your software by interacting with external systems.</paragraph><listTitle>Why is this necessary?</listTitle><list><listLine>Automation of business processes: Integration allows you to automate many tasks such as order management, payment processing, customer management, and more.</listLine><listLine>Data synchronization: Integration ensures real-time data synchronization between various systems, which helps avoid data duplication and entry errors.</listLine><listLine>Functionality expansion: Integration with external systems allows you to add new features and capabilities to your software. For example, integration with payment systems, CRM, ERP, marketing platforms, and other services can significantly expand your product's functionality.</listLine><listLine>Improved customer experience: Integration enables you to provide customers with more convenient and personalized services.</listLine><listLine>Time and resource savings: Integration reduces the time required to perform routine operations and decreases the costs of manual labor. This frees up resources for more important tasks and supports business growth.</listLine></list>"
          },
          "E-commerce Systems Development": {
            "description": "Creating flexible solutions capable of handling and processing large volumes of transactions",
            "price": "100 000",
            "fullDescription": "<mainTitle>E-commerce System Development</mainTitle><paragraph>An e-commerce system is software that enables companies to sell their products and services over the internet.</paragraph><listTitle>Why is this necessary?</listTitle><list><listLine>Access to a wide audience: Online stores allow companies to enter the global market and attract customers from all over the world. This significantly expands the potential customer base and increases sales.</listLine><listLine>Convenience for customers: Modern e-commerce systems offer user-friendly interfaces and features that make the purchasing process quick and easy for customers.</listLine><listLine>Business process automation: E-commerce systems automate many routine tasks, such as order processing, inventory management, delivery tracking, and customer management.</listLine><listLine>Analytics and reporting: E-commerce systems provide tools for analyzing sales data, customer behavior, and the effectiveness of marketing campaigns. This helps make informed decisions and improve business strategies.</listLine><listLine>Transaction security: Modern e-commerce platforms provide a high level of security to protect customer data and transactions. This increases customer trust and reduces the risk of fraud.</listLine></list>"
          },
          "Upgrading and Evolving Existing Applications": {
            "description": "From making adjustments to existing code to creating a new module from scratch",
            "price": "45 per hour",
            "fullDescription": "<mainTitle>Modification and Development of Existing Applications</mainTitle><paragraph>Modification and development of existing applications include improving functionality, fixing bugs, enhancing performance, and adapting software to changing business requirements. This service helps maintain the relevance and efficiency of your applications, ensuring they meet modern standards and needs.</paragraph><listTitle>Why is this necessary?</listTitle><list><listLine>Maintaining relevance: In a rapidly changing technological landscape, applications need regular updates to stay relevant and comply with modern standards. Modification helps your applications remain competitive.</listLine><listLine>Improving functionality: As the business grows and its needs change, there may be a need to add new features and capabilities to the existing application. Development allows the application to be adapted to current requirements.</listLine><listLine>Fixing bugs and vulnerabilities: During the operation of an application, errors and vulnerabilities may be identified that need to be promptly addressed. This helps ensure the stable and secure operation of the application.</listLine><listLine>Integration with new systems: As the business evolves, there may be a need to integrate the existing application with new systems and services. Modification ensures seamless interaction between different infrastructure components.</listLine><listLine>Performance improvement: Optimizing the code and improving the application's architecture enhances its performance, which is important for providing a fast and smooth user experience.</listLine></list>"
          }
        },
        "OUTSTAFFING": {
          "SENIOR ROR DEVELOPER (ROR, PostgreSQL, MySQL, Vue|js)": {
            "description": "Leads projects, designs architecture; Makes key technical decisions; Provides mentorship, explores new technologies",
            "price": "75 per hour",
            "fullDescription": "<mainTitle>Senior Developer</mainTitle><paragraph>Experienced developer with deep knowledge and many years of experience with Ruby on Rails.</paragraph><listTitle>Responsibilities:</listTitle><listCircle><listLine>Developing and optimizing complex functional modules and components: Creating key functional parts of the application, improving existing code to enhance performance.</listLine><listLine>Solving architectural tasks and choosing technologies for the project: Defining the structure and technology of the project to ensure its scalability and flexibility.</listLine><listLine>Mentoring and training junior developers: Training and supporting less experienced team members, helping them grow.</listLine><listLine>Code review and ensuring high code quality: Reviewing and analyzing code written by other developers to ensure its quality and compliance with standards.</listLine></listCircle>"
          },
          "Middle DEVELOPER": {
            "description": "Works independently, manages projects; Solves problems, optimizes processes; Mentors junior developers",
            "price": "55 per hour",
            "fullDescription": "<mainTitle>Middle Developer</mainTitle><paragraph>Developer with good knowledge and experience with Ruby on Rails, capable of independently solving most tasks.</paragraph><listTitle>Responsibilities:</listTitle><listCircle><listLine>Developing functional modules and components: Creating functional parts of the application, such as user interfaces and server logic.</listLine><listLine>Making improvements and fixing bugs: Optimizing code and fixing bugs to improve application performance.</listLine><listLine>Participating in code review and testing: Reviewing code from other developers and testing their own code to ensure its quality.</listLine><listLine>Collaborating with the team to implement the project: Working with other developers and specialists to successfully complete the project.</listLine></listCircle>"
          },
          "Junior+ Developer": {
            "description": "Completes tasks under supervision; Participates in training and development; Writes code, debugs issues",
            "price": "35 per hour",
            "fullDescription": "<mainTitle>Junior+ Developer</mainTitle><paragraph>Entry-level developer with basic knowledge of Ruby on Rails, ready to learn and grow.</paragraph><listTitle>Responsibilities:</listTitle><listCircle><listLine>Performing simple tasks under the guidance of more experienced colleagues: Implementing simple functions and fixing small bugs under the supervision of senior developers.</listLine><listLine>Writing and testing code: Creating code for small tasks and conducting testing to ensure its functionality.</listLine><listLine>Fixing bugs and making minor improvements: Eliminating simple errors and making small improvements to the application.</listLine><listLine>Learning new technologies and practices: Continuously learning new technologies and development methodologies.</listLine></listCircle>"
          },
          "Chief Technical Officer (CTO)": {
            "description": "Develops and implements the company's strategic technical plans; Introduces new technologies to maintain product competitiveness; Leads engineering teams",
            "price": "130 per hour",
            "fullDescription": "<mainTitle>Junior+ Developer</mainTitle><paragraph>Entry-level developer with basic knowledge of Ruby on Rails, ready to learn and grow.</paragraph><listTitle>Responsibilities:</listTitle><listCircle><listLine>Performing simple tasks under the guidance of more experienced colleagues: Implementing simple functions and fixing small bugs under the supervision of senior developers.</listLine><listLine>Writing and testing code: Creating code for small tasks and conducting testing to ensure its functionality.</listLine><listLine>Fixing bugs and making minor improvements: Eliminating simple errors and making small improvements to the application.</listLine><listLine>Learning new technologies and practices: Continuously learning new technologies and development methodologies.</listLine></listCircle>"
          },
          "Project Manager": {
            "description": "Develops project plans considering resources, timelines, and budget; Manages teams to achieve objectives; Ensures adherence to deadlines and budget constraints, minimizes risks",
            "price": "80 per hour",
            "fullDescription": "<mainTitle>Project Manager</mainTitle><paragraph>Project management specialist responsible for planning and coordinating the team's work.</paragraph><listTitle>Responsibilities:</listTitle><listCircle><listLine>Planning and monitoring task completion: Creating and managing project plans, controlling deadlines and milestones.</listLine><listLine>Coordinating team work and interacting with the client: Organizing effective interaction between team members and the client.</listLine><listLine>Managing project deadlines and budget: Ensuring that the project is completed within budget and established deadlines.</listLine><listLine>Resolving organizational issues and problems: Addressing any arising problems and ensuring smooth team operation.</listLine></listCircle>"
          },
          "Team lead": {
            "description": "Coordinates and supports team operations; Defines technical solutions and standards; Develops the team's professional skills; Ensures adherence to development processes and task deadlines",
            "price": "80 per hour",
            "fullDescription": "<mainTitle>Team Lead</mainTitle><paragraph>Leader of the development team responsible for coordinating and motivating the team.</paragraph><listTitle>Responsibilities:</listTitle><listCircle><listLine>Leading the development team: Organizing and coordinating the team's work to achieve common goals.</listLine><listLine>Developing and implementing best practices and standards: Ensuring the use of best development practices and quality standards.</listLine><listLine>Helping to solve technical problems: Supporting the team in solving complex technical issues.</listLine><listLine>Training and developing team members: Mentoring and professional development of team members.</listLine></listCircle>"
          },
          "DEVOPS": {
            "description": "Develops and implements automation; Sets up CI/CD to enhance code quality and release speed; Configures performance monitoring",
            "price": "60 per hour",
            "fullDescription": "<mainTitle>DEVOPS</mainTitle><paragraph>Specialist in automation and optimization of development and application operation processes.</paragraph><listTitle>Responsibilities:</listTitle><listCircle><listLine>Setting up and maintaining project infrastructure: Ensuring stable operation of servers, databases, and other infrastructure components.</listLine><listLine>Automating deployment and testing processes: Implementing automated deployment and testing processes to increase efficiency.</listLine><listLine>Ensuring system security and performance: Setting up security measures and optimizing performance.</listLine><listLine>Monitoring and resolving operational issues: Continuously monitoring system performance and promptly addressing emerging problems.</listLine></listCircle>"
          },
          "QA Engineer": {
            "description": "Tests products to ensure compliance with requirements; Identifies and documents bugs; Develops test plans and scenarios",
            "price": "35 per hour",
            "fullDescription": "<mainTitle>QA Engineer (Tester)</mainTitle><paragraph>Specialist in software testing and quality assurance.</paragraph><listTitle>Responsibilities:</listTitle><listCircle><listLine>Developing and executing test scenarios: Creating and executing scenarios to verify application functionality.</listLine><listLine>Automating testing: Implementing automated tests to increase testing process efficiency.</listLine><listLine>Finding and documenting bugs and errors: Identifying, documenting, and tracking bugs and errors.</listLine><listLine>Collaborating with developers to resolve identified issues: Working with developers to fix identified problems.</listLine></listCircle>"
          }
        }
      },
      "from": "from"
    },
    "OurCases": {
      "link": "our-cases",
      "title": "Breakthrough Projects",
      "description": "Our projects are the best proof of our expertise",
      "responsiveDescription": "Our projects are the best proof of our expertise",
      "cases": {
        "portal dominion capital": {
          "img": "dominio-cap.png",
          "description": "Comprehensive CRM system for optimizing internal processes of the organization for providing loans in the United States of America.",
          "goal": "The creation of a comprehensive CRM system for optimizing internal processes for providing loans in the United States of America, including the improvement of project management processes related to the creation and approval of terminology sheets, as well as enhancing functionality and user experience for more effective management of deals and credit lines.",
          "fullDescription": "<yellowHeader>Enhancing the Deal Workflow:</yellowHeader><whiteHeader>Dynamic Dropdown Link:</whiteHeader><break></break><paragraph>The link dynamically adapts based on the project stage, ensuring intuitive navigation for users.</paragraph><whiteHeader>Streamlined Creation and Approval:</whiteHeader><paragraph>The system creates a TermSheetApproval if it doesn't already exist. Additionally, approval processes are seamlessly managed, ensuring that TermSheetApproval progresses only when required conditions are met.</paragraph><whiteHeader>Document Management:</whiteHeader><paragraph>The system allows for downloading and uploading Term Sheets in various scenarios, ensuring a comprehensive repository for crucial documents.</paragraph><whiteHeader>Enhanced User Experience:</whiteHeader><paragraph>The user interface is designed to facilitate efficient workflows. For instance, the WireInfos selector is available when dealing with syndicates, simplifying decision-making.</paragraph><whiteHeader>Stimulus Integration:</whiteHeader><paragraph>Our system leverages the power of Stimulus controllers to enable specific actions at different stages, enhancing both user experience and document generation.</paragraph><whiteHeader>Audits and Notifications:</whiteHeader><paragraph>All stages of TermSheetApproval are equipped with an Audits table, providing an overview of activities. CustomAudits are intelligently generated and managed, keeping stakeholders informed.</paragraph><whiteHeader>Role-based Workflow:</whiteHeader><paragraph>User roles play a significant role in the process. Approvers and stakeholders are seamlessly integrated into the workflow, ensuring that the right individuals are involved at the right time.</paragraph><whiteHeader>Seamless Slack Integration:</whiteHeader><paragraph>The final stages of approval involve automatic Term Sheet download and submission to Slack, all managed through the system's frontend.</paragraph><yellowMarginHeader>Unveiling the Results</yellowMarginHeader><paragraph>Our team's dedication and expertise culminated in the successful completion of Task #1756 in just 87 hours and 54 minutes. Throughout the process, 64 files were updated, resulting in an impressive codebase transformation: +2733 additions and -819 deletions.</paragraph>",
          "link": ""
        },
        "Portraits of honor": {
          "img": "portraits-of-honor.png",
          "description": "Holocaust Survivors from Michigan is an interactive educational exhibit of the Program for Holocaust Survivors and their Families.",
          "goal": "The creation of an interactive educational exhibit dedicated to Holocaust survivors from Michigan, as part of the Program for Holocaust Survivors and their families, with the goal of preserving historical memory, educating future generations, and supporting survivors and their families.",
          "fullDescription": "",
          "link": "https://www.portraitsofhonor.org/"
        },
        "Loandox": {
          "img": "loandox.png",
          "description": "CRM system for Gu Loans, which provides loan services for various types of businesses.",
          "goal": "It was necessary to improve the existing CRM system for Gu Loans, which provides loan services for various types of businesses.The tasks on the client side include: 1.Development of an HTML email that the client receives after submitting an application on the website 2.Development of a document upload form 3.Development of modal windows",
          "link": "https://www.behance.net/gallery/154321453/CRM-system-for-GU-Loans"
        },
        "The Oleh Budget Calculator": {
          "img": "calculator.png",
          "description": "Development of an application for calculating and analyzing the cost of living, including transportation expenses, with dynamic visualization features and integration of real-time data.",
          "goal": "Creation of a cost of living calculator for moving to Israel, with integration of real prices and expense databases of various cities in the country.",
          "fullDescription": "<yellowHeader>Detailed Cost of Living Calculation:</yellowHeader><whiteHeader></whiteHeader><paragraph>Users can enter and customize various expenses such as housing, utilities, food, entertainment, healthcare, and more.</paragraph><paragraph>The application calculates the total monthly and annual cost of living based on the entered data.</paragraph><paragraph>A database of average expenses for different cities in Israel is supported for accurate calculations.</paragraph><whiteHeader>Transportation Component:</whiteHeader><paragraph>A separate section for transportation expenses, including options for public transportation and personal vehicle expenses.</paragraph><paragraph>Users can enter data about daily trips, type of vehicle, fuel consumption, and public transportation usage.</paragraph><paragraph>Integration with real-time traffic data and fuel prices for accurate expense calculations.</paragraph><whiteHeader>Dynamic Visualization:</whiteHeader><paragraph>Detailed charts and graphs to visually represent the expense structure.</paragraph><paragraph>An interactive chart that updates in real-time as users change the data.</paragraph><paragraph>Comparison tools that allow users to see how various changes affect the overall budget.</paragraph><whiteHeader>Currency Exchange Service:</whiteHeader><paragraph>A separate service for retrieving and updating currency exchange rates in real-time.</paragraph><paragraph>Users can enter expenses in different currencies, and the application automatically converts them using the latest exchange rate.</paragraph><paragraph>The service ensures accuracy and currency of the calculations.</paragraph><whiteHeader>Real-time Calculation:</whiteHeader><paragraph>As users enter or change expenses, the application instantly recalculates the total cost of living and updates the visual charts.</paragraph><paragraph>Instant feedback helps users understand the financial implications of their choices without delay.</paragraph>",
          "link": ""
        }
      },
      "goalText": "Goal",
      "learnMore": "View the entire case",
      "goToProject": "Go to the project",
      "orderLink": "Order Project "
    },
    "RoRAdvantages": {
      "link": "ror-advantages",
      "title": "The Power of Ruby on Rails",
      "advantages": {
        "SPEED of implementation": "Ruby on Rails allows us to significantly speed up the development process and turn ideas into functioning products, thanks to ready-made solutions for many tasks combined with our flexible methodologies, enabling us to launch your project faster than ever",
        "Database support": "Supports integration with widely-used database management systems like MySQL, PostgreSQL, and others, making it a versatile development solution",
        "Flexible Source Code": "The framework allows for code customization to meet your needs. It adapts flexibly to various types of applications required by businesses"
      }
    },
    "OurApproach": {
      "title": "Shaping the future<break></break> with each project",
      "approaches": {
        "Effective Management": "We use a version control system (Git) and provide access to our repository on platforms like GitHub or GitLab upon client request",
        "Transparency in Work": "Using CI, Capistrano, and continuous deployment to a staging server keeps you fully informed about your project's development process",
        "Code Coverage for Projects": "We ensure complete code coverage of our projects with automated tests using Rspec, Capybara, and Factorybot",
        "Monitoring and Optimization": "We perform error monitoring and resolution using Sentry and carry out performance monitoring and optimization using New Relic"
      }
    },
    "AboutUs": {
      "link": "about-us",
      "title": "Our Digital World",
      "description": "Future Markt is a digital agency that was founded in 2011. We create decentralized applications and their interfaces, develop UX/UI designs, and marketing strategies to promote projects online",
      "responsiveDescription": "Future Markt is a digital agency that was founded in 2011. We create decentralized applications and their interfaces, develop UX/UI designs, and marketing strategies to promote projects online",
      "advantages": {
        "15 years with Ruby on Rails": "Since 2009, we have been actively developing projects on Ruby on Rails, continuously expanding our experience and expertise",
        "58 projects with RoR": "We have accumulated significant experience in developing web applications, enabling us to launch your project with minimal risks and errors",
        "Complex tasks made easy": "We solve tasks of any complexity, including API development, large web application development, integration with external systems, and more"
      },
      "haveIdea": "Have an idea?",
      "sayToUs": "Tell us about it, and we'll bring it to life with Ruby on Rails",
      "contactOnTG": "Contact on Telegram:",
      "contacts": {
        "Yaroslav": {
          "post": "CMO",
          "link": "https://t.me/yarkoch"
        },
        "Vitaly": {
          "post": "product manager",
          "link": "https://t.me/vitkoz"
        }
      }
    },
    "OtherServices": {
      "title": "Other Services",
      "services": {
        "Web3 Project Development": {
          "desc": "Development of DeFi, DAO, dApp, Smart Contracts, Advising and Consulting, Token/Cryptocurrency Development",
          "link": "https://web3.futuremarkt.com/"
        },
        "Web Design": {
          "desc": "Development of landing pages, e-commerce sites, corporate websites, brand books, UX/UI interfaces",
          "link": "#"
        }
      },
      "knowMore": "Learn More"
    },
    "WeInMedia": {
      "link": "we-in-media",
      "title": "Media Hub",
      "articles": {
        "Powerful Framework for Creating Ruby APIs": {
          "img": "grape",
          "description": "If you're involved in web application or API development, you've probably heard of Grape — a powerful framework in the Ruby programming language",
          "link": "https://medium.com/@eg0rfull/grape-a-powerful-framework-for-building-apis-in-ruby-19ab8ee77d03"
        },
        "Chatbot Development Using Ruby": {
          "img": "robot",
          "description": "Ruby makes chatbot development quick and easy. In this article, we will explore the advantages of Ruby for chatbot development with code examples",
          "link": "https://medium.com/@eg0rfull/developing-chatbots-using-ruby-8d6ca827924e"
        }
      },
      "bannerTitleImg": "railsclub",
      "bannerDescripImg": "telegram channel<breakMobile></breakMobile><breakMd></breakMd> about<breakLg></breakLg><break></break> ruby on rails",
      "bannerTitle": "telegram channel about<breakMobile></breakMobile> ruby on rails - <breakLg></breakLg>railsclub",
      "bannerDescrip": "Our staff also actively engages in<breakMobile></breakMobile> expert activities on Telegram.",
      "videoLink": "#",
      "readMore": "Read More"
    },
    "HaveQuestions": {
      "title": "Any questions?",
      "leaveReq": "Submit a request or message us on Telegram, and our specialists will contact you and answer any questions you may have",
      "writeTGBtn": "Message on Telegram",
      "leaveReqLink": "Submit a Request"
    },
    "Footer": {
      "digitalAgency": "digital agency",
      "copyright": "© future markt",
      "legalEntityInfo": "Information about the Legal Entity",
      "privacy": "Privacy Policy",
      "forAllQuestions": "For all inquiries:",
      "@yarkoch": "+7 (999) 136-68-38",
      "rights": "All rights reserved",
      "upBtn": "UP",
      "addresses": {
        "+7 999 136 6838": "Russia, Nizhny Novgorod, Rodionova 192B",
        "+972 54 9965034": "Israel 90435, Zeit Shemen St 2 Efrat",
        "+1 414 212 5484": "United States of America 1366 E Sumner St, #1008, Hartford, WI 53027"
      }
    }
  }
}
