{
  "Index": {
    "Header": {
      "link": "#",
      "digitalAgency": "סוכנות דיגיטל",
      "navLinks": {
        "שירותים": "#our-help",
        "מקרי בוחן": "#our-cases",
        "יתרונות RoR": "#advantages-ror",
        "אודות": "#about-us"
      },
      "messageUs": "כתוב בטלגרם",
      "projectImplement": "יישום הפרויקט תוך חודש",
      "title": "פיתוח מהיר של הרעיון שלכם על <break></break>Ruby on Rails",
      "adaptiveTitle": "פיתוח מהיר של הרעיון שלכם על <break></break>Ruby on Rails",
      "mdTitle": "פיתוח מהיר<break></break> של הרעיון שלכם על <break></break>Ruby on Rails",
      "description": "בייעוץ חינם תקבלו ניתוח פוטנציאל ומפת<break></break> דרכים להשקה מוצלחת",
      "adaptiveDescription": "During a free consultation, you'll receive an analysis of<break></break> potential and a roadmap for a successful launch",
      "desktopDescription": "בייעוץ חינם תקבלו ניתוח פוטנציאל ומפת<break></break> דרכים להשקה מוצלחת",
      "consultationBtn": "קבל ייעוץ חינם "
    },
    "OurHelp": {
      "link": "our-help",
      "title": "איך אנחנו יכולים לעזור לכם",
      "adaptiveTitle": "איך אנחנו יכולים לעזור לכם",
      "lgTitle": "איך אנחנו יכולים לעזור לכם",
      "messageUs": "כתוב בטלגרם",
      "filters": {
        "פעילות פרויקטית": {
          "פיתוח פרויקטים באינטרנט": {
            "description": "יצירת יישומי אינטרנט איכותיים וניתנים להרחבה באמצעות פריימוורק עוצמתי וגמיש - Ruby on Rails",
            "price": "10 000",
            "fullDescription": "<mainTitle>פיתוח פרויקטים באינטרנט</mainTitle><paragraph>ניצור פרויקט אינטרנט באמצעות Ruby on Rails.</paragraph><listTitle>מה היתרונות של פיתוח זה?</listTitle><list><listLine>מהירות פיתוח: Ruby on Rails מציע למפתחים את האפשרות לפתח ולפרוס יישומי אינטרנט במהירות.</listLine><listLine>איכות קוד: Rails מעודד שימוש בפרקטיקות התכנות הטובות ביותר, כגון ארכיטקטורת MVC (Model-View-Controller), מה שהופך את הקוד לארגוני וקל לתחזוקה.</listLine><listLine>גמישות ויכולת סקלאביליות: Rails מאפשר לך לשנות ולסקלאיב יישומי אינטרנט בקלות עם התפתחות העסק.</listLine><listLine>אבטחה: Ruby on Rails כולל מנגנוני אבטחה מובנים רבים המסייעים להגן על יישומי אינטרנט מפני פגיעות נפוצות כגון הזרקות SQL, XSS ו-CSRF. זה חשוב במיוחד לפרויקטים באינטרנט העוסקים במידע רגיש.</listLine><listLine>חיסכון בעלויות: בשל מהירות הפיתוח הגבוהה ואיכות הקוד, פרויקטים של Ruby on Rails לעתים קרובות דורשים תקציב קטן יותר לפיתוח ותחזוקה בהשוואה לטכנולוגיות אחרות. זה מאפשר לעסקים לחסוך משאבים ולהקצות אותם למשימות חשובות אחרות.</listLine></list>"
          },
          "פיתוח יישומי עסקים": {
            "description": "יישומים לאופטימיזציה של תהליכים עסקיים והגברת יעילות העבודה בחברה",
            "price": "50 000",
            "fullDescription": "<mainTitle>פיתוח יישומים עסקיים</mainTitle><paragraph>יישומים עסקיים הם פתרונות תוכנה המיועדים במיוחד לאוטומציה, אופטימיזציה וניהול תהליכים עסקיים בתוך החברה.</paragraph><listTitle>למה זה נחוץ?</listTitle><list><listLine>אוטומציה של תהליכים: יישומים עסקיים מאפשרים לאוטומט משימות שגרתיות וחוזרות, מה שמשחרר את העובדים לבצע משימות מורכבות יותר.</listLine><listLine>שיפור יעילות: השימוש ביישומים עסקיים ייחודיים מסייע לשפר את התיאום בין מחלקות שונות בחברה, מפשט את חילופי המידע ומאיץ את קבלת ההחלטות.</listLine><listLine>דיוק ואמינות של נתונים: יישומים עסקיים מאפשרים לאסוף, לאחסן ולנתח כמויות גדולות של נתונים עם רמת דיוק גבוהה. זה ממזער את הסבירות לשגיאות ומאפשר לקבל החלטות מושכלות על בסיס נתונים מדויקים.</listLine><listLine>שיפור השירות ללקוחות: יישומים עסקיים, כגון מערכות CRM, מסייעים לנהל את יחסי הלקוחות טוב יותר, לעקוב אחר הצרכים וההעדפות שלהם ולספק שירות מותאם אישית יותר.</listLine><listLine>יכולת סקלאביליות וגמישות: יישומים עסקיים מודרניים קלים לסקלאיב ולמקום תחת הצרכים המשתנים של החברה. זה מאפשר לחברה לגדול ולהתפתח מבלי לבצע שינויים משמעותיים בטכנולוגיות הנמצאות בשימוש.</listLine><listLine>אבטחה וסודיות: יישומים עסקיים כוללים מנגנוני הגנה על נתונים מודרניים, מה שחשוב במיוחד לחברות העוסקות במידע רגיש. זה מסייע להגן על העסק מפני איומי סייבר ולציית לתקנות ההגנה על נתונים.</listLine></list>"
          },
          "ביקורת קוד": {
            "description": "ניתוח והערכת הפרויקט הנוכחי שלכם על: איכות הקוד, אבטחה, יכולת הרחבה וביצועים",
            "price": "700",
            "fullDescription": "<mainTitle>ביקורת קוד</mainTitle><paragraph>ביקורת קוד היא ניתוח יסודי של קוד המקור של התוכנה שלך כדי לזהות שגיאות, פגיעות, אזורים לא יעילים וחוסר התאמה לפרקטיקות הפיתוח הטובות ביותר.</paragraph><listTitle>למה זה נחוץ?</listTitle><list><listLine>הבטחת איכות הקוד: ביקורת מסייעת לאתר ולתקן שגיאות ובאגים בקוד, מה שמשפר את איכות התוכנה הכוללת ומקטין את הסבירות לתקלות ושגיאות בעתיד.</listLine><listLine>שיפור הביצועים: ביקורת מזהה אזורים לא יעילים בקוד שעלולים להאט את פעולת היישום. אופטימיזציה של אזורים אלו משפרת את הביצועים ואת מהירות התוכנה.</listLine><listLine>עמידה בסטנדרטים ובפרקטיקות הטובות ביותר: ביקורת קוד בודקת את התאמת הקוד לסטנדרטים המוגדרים ולפרקטיקות הפיתוח הטובות ביותר. זה מבטיח קלות תחזוקה ופיתוח נוסף של הפרויקט.</listLine><listLine>הפחתת חוב טכני: ביקורת קוד קבועה מסייעת להפחית חוב טכני שיכול להצטבר בפרויקט בשל שימוש בפתרונות מיושנים או תיקוני ביניים זמניים.</listLine><listLine>תיעוד והבנת הקוד: ביקורת מסייעת להבין טוב יותר את מבנה והיגיון הקוד, מה שמקל על תיעוד והעברת הקוד למפתחים אחרים. זה חשוב במיוחד לפרויקטים גדולים ולעבודת צוות.</listLine></list>"
          },
          "אינטגרציה עם מערכות חיצוניות": {
            "description": "יצירת יישומים תואמים ומקושרים, המתקשרים עם שירותים חיצוניים שונים ו-API",
            "price": "10 000",
            "fullDescription": "<mainTitle>אינטגרציה עם מערכות חיצוניות</mainTitle><paragraph>אינטגרציה עם מערכות חיצוניות כוללת את תהליך שילוב התוכנה שלך עם יישומים, שירותים או פלטפורמות אחרות. זה מאפשר אוטומציה של תהליכים עסקיים, שיפור החלפת נתונים והרחבת הפונקציונליות של התוכנה שלך באמצעות אינטראקציה עם מערכות חיצוניות.</paragraph><listTitle>למה זה נחוץ?</listTitle><list><listLine>אוטומציה של תהליכים עסקיים: אינטגרציה מאפשרת לאוטומט משימות רבות כגון ניהול הזמנות, עיבוד תשלומים, ניהול לקוחות ועוד.</listLine><listLine>סנכרון נתונים: אינטגרציה מבטיחה סנכרון נתונים בזמן אמת בין מערכות שונות, מה שמסייע למנוע כפילויות מידע וטעויות הזנה.</listLine><listLine>הרחבת פונקציונליות: אינטגרציה עם מערכות חיצוניות מאפשרת להוסיף תכונות ויכולות חדשות לתוכנה שלך. לדוגמה, אינטגרציה עם מערכות תשלום, CRM, ERP, פלטפורמות שיווק ושירותים אחרים יכולה להרחיב באופן משמעותי את הפונקציונליות של המוצר שלך.</listLine><listLine>שיפור חוויית הלקוח: אינטגרציה מאפשרת לספק ללקוחות שירות נוח ומותאם אישית יותר.</listLine><listLine>חיסכון בזמן ובמשאבים: אינטגרציה מפחיתה את הזמן הדרוש לביצוע פעולות שגרתיות ומפחיתה את העלויות של עבודת ידנית. זה משחרר משאבים למשימות חשובות יותר ותומך בצמיחת העסק.</listLine></list>"
          },
          "פיתוח מערכות מסחר אלקטרוני": {
            "description": "יצירת פתרונות גמישים, המסוגלים לקבל ולעבד כמויות גדולות של עסקאות",
            "price": "100 000",
            "fullDescription": "<mainTitle>אינטגרציה עם מערכות חיצוניות</mainTitle><paragraph>אינטגרציה עם מערכות חיצוניות כוללת את תהליך שילוב התוכנה שלך עם יישומים, שירותים או פלטפורמות אחרות. זה מאפשר אוטומציה של תהליכים עסקיים, שיפור החלפת נתונים והרחבת הפונקציונליות של התוכנה שלך באמצעות אינטראקציה עם מערכות חיצוניות.</paragraph><listTitle>למה זה נחוץ?</listTitle><list><listLine>אוטומציה של תהליכים עסקיים: אינטגרציה מאפשרת לאוטומט משימות רבות כגון ניהול הזמנות, עיבוד תשלומים, ניהול לקוחות ועוד.</listLine><listLine>סנכרון נתונים: אינטגרציה מבטיחה סנכרון נתונים בזמן אמת בין מערכות שונות, מה שמסייע למנוע כפילויות מידע וטעויות הזנה.</listLine><listLine>הרחבת פונקציונליות: אינטגרציה עם מערכות חיצוניות מאפשרת להוסיף תכונות ויכולות חדשות לתוכנה שלך. לדוגמה, אינטגרציה עם מערכות תשלום, CRM, ERP, פלטפורמות שיווק ושירותים אחרים יכולה להרחיב באופן משמעותי את הפונקציונליות של המוצר שלך.</listLine><listLine>שיפור חוויית הלקוח: אינטגרציה מאפשרת לספק ללקוחות שירות נוח ומותאם אישית יותר.</listLine><listLine>חיסכון בזמן ובמשאבים: אינטגרציה מפחיתה את הזמן הדרוש לביצוע פעולות שגרתיות ומפחיתה את העלויות של עבודת ידנית. זה משחרר משאבים למשימות חשובות יותר ותומך בצמיחת העסק.</listLine></list>"
          },
          "שדרוג ופיתוח יישומים קיימים": {
            "description": "החל מהכנסת תיקונים לקוד קיים ועד ליצירת מודול חדש מאפס",
            "price": "45 per hour",
            "fullDescription": "<mainTitle>פיתוח מערכות מסחר אלקטרוני</mainTitle><paragraph>מערכת מסחר אלקטרוני (e-commerce) היא תוכנה המאפשרת לחברות למכור את המוצרים והשירותים שלהם דרך האינטרנט.</paragraph><listTitle>למה זה נחוץ?</listTitle><list><listLine>גישה לקהל רחב: חנויות מקוונות מאפשרות לחברות להיכנס לשוק הגלובלי ולמשוך לקוחות מכל רחבי העולם. זה מרחיב באופן משמעותי את בסיס הלקוחות הפוטנציאלי ומגדיל מכירות.</listLine><listLine>נוחות ללקוחות: מערכות מסחר אלקטרוני מודרניות מציעות ממשקים נוחים ותכונות שהופכות את תהליך הרכישה למהיר וקל עבור הלקוחות.</listLine><listLine>אוטומציה של תהליכים עסקיים: מערכות מסחר אלקטרוני מאוטומטות משימות רבות, כגון עיבוד הזמנות, ניהול מלאי, מעקב אחר משלוחים וניהול לקוחות.</listLine><listLine>אנליטיקה ודוחות: מערכות מסחר אלקטרוני מספקות כלים לניתוח נתוני מכירות, התנהגות לקוחות ויעילות קמפיינים שיווקיים. זה עוזר לקבל החלטות מושכלות ולשפר אסטרטגיות עסקיות.</listLine><listLine>אבטחת עסקאות: פלטפורמות מסחר אלקטרוני מודרניות מספקות רמת אבטחה גבוהה להגנה על נתוני לקוחות ועסקאות. זה מעלה את אמון הלקוחות ומפחית את הסיכון להונאות.</listLine></list>"
          }
        },
        "אאוטסטאף": {
          "מפתח בכיר": {
            "description": "מוביל פרויקטים, בונה ארכיטקטורה; מקבל החלטות טכניות מפתחיות; מספק חונכות, חוקר טכנולוגיות חדשות",
            "price": "75 per hour",
            "fullDescription": "<mainTitle>מפתח בכיר</mainTitle><paragraph>מפתח מנוסה עם ידע עמוק וניסיון רב ב-Ruby on Rails.</paragraph><listTitle>תחומי עיסוק:</listTitle><listCircle><listLine>פיתוח ואופטימיזציה של מודולים ורכיבים מורכבים: יצירת חלקים פונקציונליים מרכזיים של האפליקציה, שיפור הקוד הקיים לשיפור הביצועים.</listLine><listLine>פתרון משימות ארכיטקטוניות ובחירת טכנולוגיות לפרויקט: הגדרת מבנה וטכנולוגיית הפרויקט להבטחת סקיילביליות וגמישות.</listLine><listLine>הדרכה והכשרת מפתחים זוטרים: הדרכה ותמיכה בחברי צוות פחות מנוסים, סיוע בהתפתחותם.</listLine><listLine>סקירת קוד והבטחת איכות גבוהה של הקוד: סקירה וניתוח של קוד שנכתב על ידי מפתחים אחרים להבטחת איכות ועומד בסטנדרטים.</listLine></listCircle>"
          },
          "מפתח ביניים": {
            "description": "עובד באופן עצמאי, מנהל היבטים בפרויקט; פותר בעיות, משפר תהליכים; מנחה מפתחים צעירים",
            "price": "55 per hour",
            "fullDescription": "<mainTitle>מפתח ביניים</mainTitle><paragraph>מפתח עם ידע טוב וניסיון בעבודה עם Ruby on Rails, מסוגל לפתור את רוב המשימות באופן עצמאי.</paragraph><listTitle>תחומי עיסוק:</listTitle><listCircle><listLine>פיתוח מודולים ורכיבים פונקציונליים: יצירת חלקים פונקציונליים של האפליקציה, כמו ממשקי משתמש ולוגיקת שרת.</listLine><listLine>הכנסת שיפורים ותיקון באגים: אופטימיזציה של קוד ותיקון באגים לשיפור ביצועי האפליקציה.</listLine><listLine>השתתפות בסקירת קוד ובדיקות: סקירת קוד של מפתחים אחרים ובדיקת הקוד שלהם להבטחת האיכות.</listLine><listLine>שיתוף פעולה עם הצוות למימוש הפרויקט: עבודה עם מפתחים ואנשי מקצוע אחרים להשלמה מוצלחת של הפרויקט.</listLine></listCircle>"
          },
          "מפתח ג'וניור+": {
            "description": "מבצע משימות בהנחיה; משתתף בהכשרה ובפיתוח; כותב קוד, מתקן באגים",
            "price": "35 per hour",
            "fullDescription": "<mainTitle>מפתח זוטר+</mainTitle><paragraph>מפתח מתחיל עם ידע בסיסי ב-Ruby on Rails, מוכן ללמידה והתפתחות.</paragraph><listTitle>תחומי עיסוק:</listTitle><listCircle><listLine>ביצוע משימות פשוטות בהנחיית עמיתים מנוסים יותר: מימוש פונקציות פשוטות ותיקון באגים קטנים תחת השגחת מפתחים בכירים.</listLine><listLine>כתיבת ובדיקת קוד: יצירת קוד למשימות קטנות וביצוע בדיקות להבטחת תקינותו.</listLine><listLine>תיקון באגים ושיפורים קטנים: הסרת שגיאות פשוטות והכנסת שיפורים קטנים לאפליקציה.</listLine><listLine>למידת טכנולוגיות ופרקטיקות חדשות: לימוד מתמשך של טכנולוגיות ושיטות פיתוח חדשות.</listLine></listCircle>"
          },
          "מנהל טכני": {
            "description": "מפתח ומיישם תוכניות טכניות אסטרטגיות של החברה; מיישם טכנולוגיות חדשות לשמירה על תחרותיות המוצרים; מנהל צוותים הנדסיים",
            "price": "130 per hour",
            "fullDescription": "<mainTitle>מנהל טכני</mainTitle><paragraph>מנהל החלק הטכני של הפרויקט עם ניסיון נרחב וראייה אסטרטגית.</paragraph><listTitle>תחומי עיסוק:</listTitle><listCircle><listLine>פיתוח אסטרטגיה טכנית וארכיטקטורת הפרויקט: הגדרת האסטרטגיה הטכנית הכוללת והארכיטקטורה של הפרויקט להגשמת מטרות ארוכות טווח.</listLine><listLine>הובלת צוות המפתחים: ארגון ותיאום עבודת צוות המפתחים.</listLine><listLine>הבטחת איכות הקוד והתאמה לסטנדרטים: הבטחת עמידה בכל הסטנדרטים של איכות ושיטות פיתוח מיטביות.</listLine><listLine>קבלת החלטות טכניות מרכזיות: קבלת החלטות אסטרטגיות המשפיעות על הכיוון הטכני של הפרויקט.</listLine></listCircle>"
          },
          "מנהל פרויקטים": {
            "description": "מפתח תוכניות פרויקט מפורטות, בהתחשב במשאבים, בלוחות הזמנים ובתקציב; מנהל צוותים להשגת מטרות; מבטיח עמידה בלוחות זמנים ובמגבלות תקציב, ממזער סיכונים",
            "price": "80 per hour",
            "fullDescription": "<mainTitle>מנהל פרויקטים</mainTitle><paragraph>מומחה בניהול פרויקטים, אחראי על תכנון ותיאום עבודת הצוות.</paragraph><listTitle>תחומי עיסוק:</listTitle><listCircle><listLine>תכנון ובקרה על ביצוע המשימות: יצירה וניהול של תוכניות הפרויקט, בקרת לוחות זמנים ושלבים.</listLine><listLine>תיאום עבודת הצוות ואינטראקציה עם הלקוח: ארגון אינטראקציה יעילה בין חברי הצוות והלקוח.</listLine><listLine>ניהול לוחות זמנים ותקציב הפרויקט: הבטחת השלמת הפרויקט במסגרת התקציב ולוחות הזמנים שנקבעו.</listLine><listLine>פתרון בעיות ארגוניות: טיפול בכל בעיות המתעוררות והבטחת פעולה חלקה של הצוות.</listLine></listCircle>"
          },
          "ראש צוות": {
            "description": "מתאם ותומך בעבודת הצוות; מגדיר פתרונות טכניים וסטנדרטים; מפתח את הכישורים המקצועיים של הצוות; מבטיח עמידה בתהליכי פיתוח ולוחות זמנים של המשימות",
            "price": "80 per hour",
            "fullDescription": "<mainTitle>מוביל צוות</mainTitle><paragraph>מוביל צוות פיתוח אחראי על תיאום ומוטיבציה של הצוות.</paragraph><listTitle>תחומי עיסוק:</listTitle><listCircle><listLine>הובלת צוות הפיתוח: ארגון ותיאום עבודת הצוות להשגת מטרות משותפות.</listLine><listLine>פיתוח והטמעת פרקטיקות ותקנים מיטביים: הבטחת השימוש בפרקטיקות פיתוח מיטביות ותקני איכות.</listLine><listLine>סיוע בפתרון בעיות טכניות: תמיכה בצוות בפתרון בעיות טכניות מורכבות.</listLine><listLine>הכשרה ופיתוח חברי הצוות: הדרכה ופיתוח מקצועי של חברי הצוות.</listLine></listCircle>"
          },
          "מהנדס DevOps": {
            "description": "מפתח ומיישם אוטומציה; מארגן CI/CD לשיפור איכות הקוד ומהירות ההפצה; מגדיר ניטור ביצועים",
            "price": "60 per hour",
            "fullDescription": "<mainTitle>DEVOPS</mainTitle><paragraph>מומחה באוטומציה ואופטימיזציה של תהליכי פיתוח והפעלת יישומים.</paragraph><listTitle>תחומי עיסוק:</listTitle><listCircle><listLine>הגדרה ותחזוקת תשתיות הפרויקט: הבטחת תפעול יציב של שרתים, מסדי נתונים ורכיבי תשתית אחרים.</listLine><listLine>אוטומציה של תהליכי פריסה ובדיקה: הטמעת תהליכי פריסה ובדיקה אוטומטיים לשיפור היעילות.</listLine><listLine>הבטחת אבטחת המערכת וביצועיה: הגדרת אמצעי אבטחה ואופטימיזציה של הביצועים.</listLine><listLine>מעקב ופתרון בעיות תפעוליות: מעקב רציף אחר ביצועי המערכת ופתרון בעיות במהירות.</listLine></listCircle>"
          },
          "מהנדס QA (בודק תוכנה)": {
            "description": "בודק מוצרים להבטחת עמידה בדרישות; מזהה ומתעד באגים; מפתח תוכניות ותסריטי בדיקה",
            "price": "3 per hour",
            "fullDescription": "<mainTitle>מהנדס QA (בודק)</mainTitle><paragraph>מומחה בבדיקות תוכנה והבטחת איכות.</paragraph><listTitle>תחומי עיסוק:</listTitle><listCircle><listLine>פיתוח וביצוע תרחישי בדיקה: יצירה וביצוע של תרחישים לבדיקת פונקציונליות היישום.</listLine><listLine>אוטומציה של בדיקות: הטמעת בדיקות אוטומטיות לשיפור יעילות תהליך הבדיקה.</listLine><listLine>איתור ותיעוד באגים ושגיאות: זיהוי, תיעוד ומעקב אחר באגים ושגיאות.</listLine><listLine>שיתוף פעולה עם מפתחים לתיקון בעיות שזוהו: עבודה משותפת עם מפתחים לתיקון בעיות שזוהו.</listLine></listCircle>"
          }
        }
      },
      "from": "מ-"
    },
    "OurCases": {
      "link": "our-cases",
      "title": "פרויקטים פורצי דרך",
      "description": "הפרויקטים שלנו — ההוכחה הטובה ביותר למומחיות שלנו",
      "responsiveDescription": "Our projects are the best proof of our expertise",
      "cases": {
        "portal dominion capital": {
          "img": "dominio-cap.png",
          "description": "מערכת CRM מקיפה לאופטימיזציה של תהליכים פנימיים בארגון למתן הלוואות בארצות הברית.",
          "goal": "יצירת מערכת CRM מקיפה לאופטימיזציה של תהליכים פנימיים למתן הלוואות בארצות הברית, כולל שיפור תהליכי ניהול פרויקטים הקשורים ליצירה ואישור של דפי תנאים, וכן שיפור הפונקציונליות וחוויית המשתמש לניהול יעיל יותר של עסקאות וקווי אשראי.",
          "fullDescription": "<yellowHeader>שיפור תהליך העסקאות:</yellowHeader> <whiteHeader>קישור דינמי בתפריט נפתח:</whiteHeader> <paragraph>הקישור מתאמת דינמית בהתאם לשלב הפרויקט, ומבטיח ניווט אינטואיטיבי למשתמשים.</paragraph> <whiteHeader>יצירה ואישור יעילים:</whiteHeader> <paragraph>המערכת יוצרת TermSheetApproval אם הוא לא קיים. בנוסף, תהליכי האישור מנוהלים בצורה חלקה, מבטיחים שה-TermSheetApproval מתקדם רק כאשר מתקיימים התנאים הנדרשים.</paragraph> <whiteHeader>ניהול מסמכים:</whiteHeader> <paragraph>המערכת מאפשרת הורדה והעלאה של דפי תנאים בתרחישים שונים, ומבטיחה מאגר מקיף למסמכים קריטיים.</paragraph> <whiteHeader>חוויית משתמש משופרת:</whiteHeader> <paragraph>ממשק המשתמש מעוצב להקל על תהליכי עבודה יעילים. למשל, הסלקטור של WireInfos זמין בעת עבודה עם סינדיקטים, מה שמפשט את קבלת ההחלטות.</paragraph> <whiteHeader>שילוב Stimulus:</whiteHeader> <paragraph>המערכת שלנו מנצלת את הכוח של בקרי Stimulus לביצוע פעולות ספציפיות בשלבים שונים, ומשפרת את חוויית המשתמש ואת יצירת המסמכים.</paragraph> <whiteHeader>ביקורות והתראות:</whiteHeader> <paragraph>כל שלבי ה-TermSheetApproval מצוידים בטבלת ביקורות, המספקת סקירה של הפעילויות. CustomAudits נוצרים ומנוהלים בצורה חכמה, ומודיעים לבעלי העניין.</paragraph> <whiteHeader>תהליך עבודה מבוסס תפקידים:</whiteHeader> <paragraph>תפקידי המשתמשים ממלאים תפקיד משמעותי בתהליך. מאשרים ובעלי העניין משולבים בצורה חלקה בתהליך העבודה, ומבטיחים שהאנשים הנכונים מעורבים בזמן הנכון.</paragraph> <whiteHeader>שילוב חלק עם Slack:</whiteHeader> <paragraph>השלבים הסופיים של האישור כוללים הורדה אוטומטית של Term Sheet והגשה ל-Slack, הכל מנוהל דרך ממשק המערכת.</paragraph> <whiteHeader>חשיפת התוצאות:</whiteHeader> <paragraph>המסירות והמומחיות של הצוות שלנו הביאו להשלמה מוצלחת של משימה מספר #1756 תוך 87 שעות ו-54 דקות בלבד. במהלך התהליך, עודכנו 64 קבצים, מה שהביא לשינוי מרשים בבסיס הקוד: +2733 תוספות ו-819 מחיקות.</paragraph>",
          "link": ""
        },
        "Portraits of honor": {
          "img": "portraits-of-honor.png",
          "description": "ניצולי השואה ממישיגן הם תערוכה חינוכית אינטראקטיבית של התוכנית לניצולי השואה ובני משפחותיהם.",
          "goal": "The creation of an interactive educational exhibit dedicated to Holocaust survivors from Michigan, as part of the Program for Holocaust Survivors and their families, with the goal of preserving historical memory, educating future generations, and supporting survivors and their families.",
          "fullDescription": "",
          "link": "https://www.portraitsofhonor.org/"
        },
        "Loandox": {
          "img": "loandox.png",
          "description": "מערכת CRM עבור Gu Loans, המספקת שירותי הלוואות לסוגים שונים של עסקים.",
          "goal": "היה צורך לשפר את מערכת ה-CRM הקיימת עבור Gu Loans, המספקת שירותי הלוואות לסוגים שונים של עסקים. המשימות בצד הלקוח כוללות: פיתוח דול HTML שהלקוח מקבל לאחר הגשת בקשה באתר פיתוח טופס העלאת מסמכים פיתוח חלונות מודאליים",
          "link": "https://www.behance.net/gallery/154321453/CRM-system-for-GU-Loans"
        },
        "The Oleh Budget Calculator": {
          "img": "calculator.png",
          "description": "פיתוח יישום לחישוב וניתוח יוקר המחיה, כולל הוצאות תחבורה, עם תכונות ויזואליזציה דינמיות ואינטגרציה של נתונים בזמן אמת.",
          "goal": "Creation of a cost of living calculator for moving to Israel, with integration of real prices and expense databases of various cities in the country.",
          "fullDescription": "<yellowHeader>פירוט חישוב יוקר המחיה:</yellowHeader><paragraph>משתמשים יכולים להזין ולהתאים הוצאות שונות כגון דיור, שירותים ציבוריים, מזון, בידור, בריאות ועוד.</paragraph><paragraph>היישום מחשב את סך כל יוקר המחיה החודשי והשנתי בהתבסס על הנתונים שהוזנו.</paragraph><paragraph>נתמכת מסד נתונים של הוצאות ממוצעות לערים שונות בישראל לצורך חישובים מדויקים.</paragraph><whiteHeader>רכיב התחבורה:</whiteHeader><paragraph>סעיף נפרד להוצאות תחבורה, כולל אפשרויות לתחבורה ציבורית, הוצאות על רכב פרטי.</paragraph><paragraph>משתמשים יכולים להזין נתונים על נסיעות יומיות, סוג הרכב, צריכת הדלק והשימוש בתחבורה הציבורית.</paragraph><paragraph>אינטגרציה עם נתוני תנועה ומחירי דלק בזמן אמת לצורך חישוב הוצאות מדויק.</paragraph><whiteHeader>ויזואליזציה דינמית:</whiteHeader><paragraph>תרשימים וגרפים מפורטים להצגת מבנה ההוצאות בצורה ויזואלית.</paragraph><paragraph>תרשים אינטראקטיבי שמתעדכן בזמן אמת ככל שהמשתמשים משנים את הנתונים.</paragraph><paragraph>כלים להשוואה שמאפשרים לראות כיצד שינויים שונים משפיעים על התקציב הכולל.</paragraph><whiteHeader>שירות שערי מטבע:</whiteHeader><paragraph>שירות נפרד לקבלה ועדכון שערי מטבע בזמן אמת.</paragraph><paragraph>משתמשים יכולים להזין הוצאות במטבעות שונים, והיישום ממיר אותן אוטומטית לפי השער האחרון.</paragraph><paragraph>השירות מבטיח דיוק ועדכניות בחישובי העלות.</paragraph><whiteHeader>חישוב בזמן אמת:</whiteHeader><paragraph>ככל שהמשתמשים מזינים או משנים הוצאות, היישום מחשב מחדש את סך יוקר המחיה ומעדכן את התרשימים הוויזואליים באופן מיידי.</paragraph><paragraph>משוב מיידי עוזר למשתמשים להבין את ההשלכות הכלכליות של הבחירות שלהם ללא עיכובים.</paragraph>",
          "link": ""
        }
      },
      "goalText": "מטרה:",
      "learnMore": "צפה בכל המקרה",
      "goToProject": "לעבור לפרויקט",
      "orderLink": "הזמנת פרויקט"
    },
    "RoRAdvantages": {
      "link": "ror-advantages",
      "title": "הכוח של Ruby on Rails",
      "advantages": {
        "מהירות היישום": "Ruby on Rails מאפשר לנו להאיץ משמעותית את תהליך הפיתוח ולהפוך רעיונות למוצרים פעילים הודות לנוכחות פתרונות מוכנים לרבות משימות, בשילוב עם המתודולוגיות הגמישות שלנו, כדי להשיק את הפרויקט שלכם מהר יותר מאי פעם",
        "תמיכה במסדי נתונים": "תומך בעבודה עם רוב מערכות ניהול מסדי הנתונים הידועות, כגון MySQL, PostgreSQL ואחרות, מה שהופך אותו לפתרון אוניברסלי לפיתוח",
        "קוד מקור גמיש": "המסגרת מספקת אפשרות להתאים את הקוד לצרכים שלכם. מתאימה בגמישות לסוגים שונים של יישומים הדרושים לעסק"
      }
    },
    "OurApproach": {
      "title": "מעצבים את העתיד עם<break></break>כל פרויקט",
      "approaches": {
        "ניהול יעיל": "אנו משתמשים במערכת בקרת גרסאות (Git), ומספקים לפי בקשת הלקוח גישה למאגר שלנו בפלטפורמות GitHub או GitLab",
        "שקיפות בעבודה": "בעזרת CI, Capistrano ופריסה רציפה בשרת staging, אתם תמיד מעודכנים בתהליך הפיתוח של הפרויקט שלכם",
        "כיסוי קוד הפרויקטים": "אנו מספקים כיסוי מלא של קוד הפרויקטים שלנו באמצעות בדיקות אוטומטיות עם Rspec, Capybara ו-Factorybot",
        "ניטור ואופטימיזציה": "אנו מבצעים ניטור ותיקון שגיאות בעזרת Sentry, ומבצעים ניטור ואופטימיזציה של הביצועים באמצעות New Relic"
      }
    },
    "AboutUs": {
      "link": "about-us",
      "title": "העולם הדיגיטלי שלנו",
      "description": "סוכנות דיגיטל שהוקמה בשנת 2011. אנו יוצרים יישומים מבוזרים וממשקים אליהם, מפתחים עיצובי UX/UI ואסטרטגיות שיווק לקידום פרויקטים ברשת.",
      "responsiveDescription": "Future Markt is a digital agency that was founded in 2011. We create decentralized applications and their interfaces, develop UX/UI designs, and marketing strategies to promote projects online",
      "advantages": {
        "15 שנים עם Ruby on Rails": "מאז 2009 אנו מפתחים באופן פעיל פרויקטים ב-Ruby on Rails, ומרחיבים ללא הרף את הניסיון והמומחיות שלנו",
        "58 פרויקטים עם RoR": "צברנו ניסיון רב בפיתוח יישומי אינטרנט, כדי להשיק את הפרויקט שלכם עם מינימום סיכונים וטעויות",
        "משימות מורכבות - בקלות": "אנו פותרים משימות בכל רמת קושי: פיתוח API, פיתוח יישומי אינטרנט גדולים, שילוב עם מערכות חיצוניות ועוד"
      },
      "haveIdea": "יש לכם רעיון?",
      "sayToUs": "ספרו לנו עליה, אנחנו נממש אותה ב-Ruby on Rails",
      "contactOnTG": "צרו קשר דרך טלגרם:",
      "contacts": {
        "Yaroslav": {
          "post": "CMO",
          "link": "https://t.me/yarkoch"
        },
        "Vitaly": {
          "post": "מנהל מוצר",
          "link": "https://t.me/vitkoz"
        }
      }
    },
    "OtherServices": {
      "title": "שירותים נוספים שלנו",
      "services": {
        "פיתוח פרויקטים של Web-3": {
          "desc": "פיתוח DeFi, Dao, dApp, חוזים חכמים, ייעוץ ופיתוח טוקנים/מטבעות קריפטו",
          "link": "https://web3.futuremarkt.com/"
        },
        "עיצוב אתרים": {
          "desc": "פיתוח דף נחיתה, חנות אינטרנט, אתר חברה, ספר מותג, ממשקי UX/UI",
          "link": ""
        }
      },
      "knowMore": "למידע נוסף"
    },
    "WeInMedia": {
      "link": "we-in-media",
      "title": "מרכז מדיה",
      "articles": {
        "פריימוורק עוצמתי ליצירת API ב-Ruby": {
          "img": "grape",
          "description": "אם אתם עוסקים בפיתוח יישומי אינטרנט או API, כנראה שמעתם על Grape - פריימוורק עוצמתי בשפת התכנות Ruby",
          "link": "https://medium.com/@eg0rfull/grape-a-powerful-framework-for-building-apis-in-ruby-19ab8ee77d03"
        },
        "פיתוח צ'אט-בוטים באמצעות Ruby": {
          "img": "robot",
          "description": "Ruby עושה את פיתוח הצ'אט-בוטים מהיר וקל. במאמר זה נבחן את יתרונות Ruby לפיתוח צ'אט-בוטים עם דוגמאות קוד.",
          "link": "https://medium.com/@eg0rfull/developing-chatbots-using-ruby-8d6ca827924e"
        }
      },
      "bannerTitleImg": "railshub",
      "bannerDescripImg": "ערוץ טלגרם על רובי און<breakMd></breakMd><breakMobile></breakMobile> ריילס",
      "bannerTitle": "ערוץ טלגרם על רובי און ריילס - RailsClub",
      "bannerDescrip": "גם הצוות שלנו עוסק בפעילות מקצועית בטלגרם.",
      "videoLink": "#",
      "readMore": "לקרוא במלואו"
    },
    "HaveQuestions": {
      "title": "נשארו שאלות?",
      "leaveReq": "השאירו בקשה או כתבו לנו ב-Telegram, המומחים שלנו יצרו אתכם קשר ויענו על כל שאלה שלכם",
      "writeTGBtn": "השארת בקשה",
      "leaveReqLink": "כתוב ב-Telegram"
    },
    "Footer": {
      "digitalAgency": "סוכנות דיגיטל",
      "copyright": "© future markt",
      "legalEntityInfo": "מידע על הישות המשפטית",
      "privacy": "מדיניות פרטיות",
      "forAllQuestions": "לכל השאלות:",
      "@yarkoch": "+7 (999) 136-68-38",
      "rights": "כל הזכויות שמורות",
      "upBtn": "למעלה",
      "addresses": {
        "+7 999 136 6838": "Russia, Nizhny Novgorod, Rodionova 192B",
        "+972 54 9965034": "Israel 90435, Zeit Shemen St 2 Efrat",
        "+1 414 212 5484": "United States of America 1366 E Sumner St, #1008, Hartford, WI 53027"
      }
    }
  }
}
