{
  "Index": {
    "Header": {
      "link": "#",
      "digitalAgency": "digital agency",
      "navLinks": {
        "Услуги": "#our-help",
        "Кейсы": "#our-cases",
        "Преимущества RoR": "#advantages-ror",
        "О нас": "#about-us"
      },
      "messageUs": "Написать в телеграм",
      "projectImplement": "Внедрение проекта за 1 месяц",
      "title": "быстрая разработка<break></break> вашей идеи на ruby on rails",
      "adaptiveTitle": "быстрая<break></break> разработка<break></break> вашей идеи<break></break> на ruby on rails",
      "mdTitle": "быстрая разработка<break></break> вашей идеи<break></break> на ruby on rails",
      "description": "На бесплатной консультации вы получите<break></break> анализ потенциала и дорожную карту для успешного запуска",
      "adaptiveDescription": "На бесплатной консультации вы получите<break></break> анализ потенциала и дорожную карту для<breakTwo></breakTwo> успешного запуска",
      "desktopDescription": "На бесплатной консультации вы получите анализ <break></break>потенциала и дорожную карту для успешного запуска",
      "consultationBtn": "Получить бесплатную консультацию "
    },
    "OurHelp": {
      "link": "our-help",
      "title": "чем мы можем вам помочь",
      "adaptiveTitle": "услуги",
      "lgTitle": "чем мы можем<breakMd></breakMd> вам помочь",
      "messageUs": "Написать в телеграм",
      "filters": {
        "Проектная деятельность": {
          "Разработка веб-проектов": {
            "description": "Создание качественных и масштабируемых веб-приложений с использованием мощного и гибкого фреймворка - Ruby on Rails",
            "price": "10 000",
            "fullDescription": "<mainTitle>Разработка веб-проектов</mainTitle><paragraph>Создадим веб-проект с помощью Ruby on Rails.</paragraph><listTitle>Какие преимущества у данной разработки?</listTitle><list><listLine>Скорость разработки: Ruby on Rails предлагает разработчикам возможность быстро разрабатывать и развертывать веб-приложения.</listLine><listLine>Качество кода: Rails поощряет использование лучших практик программирования, таких как MVC (Model-View-Controller) архитектура, что делает код более организованным и поддерживаемым.</listLine><listLine>Гибкость и масштабируемость: Rails позволяет легко изменять и масштабировать веб-приложения по мере роста бизнеса.</listLine><listLine>Безопасность: Ruby on Rails включает множество встроенных механизмов безопасности, которые помогают защитить веб-приложения от распространенных уязвимостей, таких как SQL-инъекции, XSS и CSRF.Это особенно важно для веб-проектов, работающих с конфиденциальными данными.</listLine><listLine>Экономия средств: Благодаря высокой скорости разработки и качеству кода, проекты на Ruby on Rails часто требуют меньшего бюджета на разработку и поддержку по сравнению с другими технологиями. Это позволяет бизнесам экономить ресурсы и направлять их на другие важные задачи.</listLine></list>"
          },
          "Разработка бизнес-приложений": {
            "description": "Приложения для оптимизации бизнес-процессов и повышение эффективность работы компании",
            "price": "50 000",
            "fullDescription": "<mainTitle>Разработка бизнес- приложений</mainTitle><paragraph>Бизнес-приложения — это программные решения, разработанные специально для автоматизации, оптимизации и управления бизнес-процессами внутри компании.</paragraph><listTitle>Зачем это нужно?</listTitle><list><listLine>Автоматизация процессов: Бизнес-приложения позволяют автоматизировать рутинные и повторяющиеся задачи, что освобождает сотрудников для выполнения более сложных задач.</listLine><listLine>Повышение эффективности: Использование специализированных бизнес-приложений помогает улучшить координацию между различными отделами компании, упрощает обмен информацией и ускоряет принятие решений.</listLine><listLine>Точность и надежность данных: Приложения для бизнеса позволяют собирать, хранить и анализировать большие объемы данных с высокой степенью точности. Это минимизирует вероятность ошибок и позволяет принимать обоснованные решения на основе точных данных.</listLine><listLine>Улучшение клиентского сервиса: Бизнес-приложения, такие как CRM-системы, помогают лучше управлять взаимоотношениями с клиентами, отслеживать их потребности и предпочтения, а также предоставлять более персонализированный сервис.</listLine><listLine>Масштабируемость и гибкость: Современные бизнес-приложения легко масштабируются и адаптируются под меняющиеся потребности компании. Это позволяет компании расти и развиваться без необходимости значительных изменений в используемых технологиях.</listLine><listLine>Безопасность и конфиденциальность: Бизнес-приложения включают современные механизмы защиты данных, что особенно важно для компаний, работающих с конфиденциальной информацией. Это помогает защитить бизнес от киберугроз и соблюсти требования законодательства по защите данных.</listLine></list>"
          },
          "Аудит кода": {
            "description": "Анализ и оценка вашего текущего проекта на: качество кода, безопасность, масштабируемость и производительность",
            "price": "700",
            "fullDescription": "<mainTitle>Аудит кода</mainTitle><paragraph>Аудит кода — это тщательный анализ исходного кода вашего программного обеспечения с целью выявления ошибок, уязвимостей, неэффективных участков и несоответствий лучшим практикам разработки.</paragraph><listTitle>Зачем это нужно?</listTitle><list><listLine>Обеспечение качества кода: Аудит помогает обнаружить и исправить ошибки и баги в коде, что улучшает общее качество программного обеспечения и снижает вероятность сбоев и ошибок в будущем.</listLine><listLine>Повышение производительности: Аудит выявляет неэффективные участки кода, которые могут замедлять работу приложения. Оптимизация этих участков улучшает производительность и скорость работы программного обеспечения.</listLine><listLine>Соблюдение стандартов и лучших практик: Аудит кода проверяет соответствие кода установленным стандартам и лучшим практикам разработки. Это обеспечивает удобство поддержки и дальнейшего развития проекта.</listLine><listLine>Снижение технического долга: Регулярный аудит кода помогает снижать технический долг, который может накапливаться в проекте из-за использования устаревших решений или временных \"заплаток\".</listLine><listLine>Документирование и понимание кода: Аудит помогает лучше понять структуру и логику кода, что упрощает его документирование и передачу другим разработчикам. Это особенно важно для крупных проектов и командной работы.</listLine></list>"
          },
          "Интеграция с внешними системами": {
            "description": "Создание совместимых и связанных приложений, которые взаимодействуют с различными внешними сервисами и API",
            "price": "10 000",
            "fullDescription": "<mainTitle>Интеграция с внешними системами</mainTitle><paragraph>Интеграция с внешними системами представляет собой процесс объединения вашего программного обеспечения с другими приложениями, сервисами или платформами. Это позволяет автоматизировать бизнес-процессы, улучшить обмен данными и расширить функциональные возможности вашего ПО за счет взаимодействия с внешними системами.</paragraph><listTitle>Зачем это нужно?</listTitle><list><listLine>Автоматизация бизнес-процессов: Интеграция позволяет автоматизировать множество задач, таких как управление заказами, обработка платежей, управление клиентами и т.д.</listLine><listLine>Синхронизация данных: Интеграция обеспечивает синхронизацию данных между различными системами в реальном времени, что позволяет избежать дублирования информации и ошибок при вводе данных.</listLine><listLine>Расширение функциональности: Интеграция с внешними системами позволяет добавлять новые функции и возможности в ваше ПО. Например, интеграция с платежными системами, CRM, ERP, маркетинговыми платформами и другими сервисами может значительно расширить функциональность вашего продукта.</listLine><listLine>Улучшение клиентского опыта: С помощью интеграции вы можете предоставить клиентам более удобный и персонализированный сервис.</listLine><listLine>Экономия времени и ресурсов: Интеграция позволяет сократить время на выполнение рутинных операций и снизить затраты на ручной труд. Это освобождает ресурсы для более важных задач и способствует росту бизнеса.</listLine></list>"
          },
          "Разработка систем электронной коммерции": {
            "description": "Создание гибких решений, способных принимать и обрабатывать большие объемы транзакций",
            "price": "100 000",
            "fullDescription": "<mainTitle>Разработка систем электронной коммерции</mainTitle><paragraph>Система электронной коммерции (e-commerce) — это программное обеспечение, которое позволяет компаниям продавать свои товары и услуги через интернет.</paragraph><listTitle>Зачем это нужно?</listTitle><list><listLine>Доступ к широкой аудитории: Интернет-магазины позволяют компаниям выходить на глобальный рынок и привлекать клиентов со всего мира. Это значительно расширяет потенциальную клиентскую базу и увеличивает продажи.</listLine><listLine>Удобство для клиентов: Современные системы электронной коммерции предлагают удобные интерфейсы и функции, которые делают процесс покупки быстрым и простым для клиентов.</listLine><listLine>Автоматизация бизнес-процессов: Системы e-commerce автоматизируют многие рутинные задачи, такие как обработка заказов, управление инвентарем, отслеживание доставки и управление клиентами.</listLine><listLine>Аналитика и отчеты: Системы электронной коммерции предоставляют инструменты для анализа данных о продажах, поведении клиентов и эффективности маркетинговых кампаний. Это помогает принимать обоснованные решения и улучшать бизнес-стратегии.</listLine><listLine>Безопасность транзакций: Современные e-commerce платформы обеспечивают высокий уровень безопасности для защиты данных клиентов и транзакций. Это повышает доверие клиентов и снижает риски мошенничества.</listLine></list>"
          },
          "Доработка и развитие существующих приложений": {
            "description": "От внесение коррективов в существующий код до создание нового модуля с нуля",
            "price": "45 per hour",
            "fullDescription": "<mainTitle>Доработка и развитие существующих приложений</mainTitle><paragraph>Доработка и развитие существующих приложений включают в себя улучшение функциональности, исправление ошибок, повышение производительности и адаптацию программного обеспечения к изменяющимся бизнес-требованиям. Эта услуга позволяет поддерживать актуальность и эффективность ваших приложений, обеспечивая их соответствие современным стандартам и потребностям.</paragraph><listTitle>Зачем это нужно?</listTitle><list><listLine>Поддержка актуальности: В условиях быстро меняющегося технологического ландшафта приложения нуждаются в регулярных обновлениях для поддержания актуальности и соответствия современным стандартам. Доработка помогает вашим приложениям оставаться конкурентоспособными.</listLine><listLine>Улучшение функциональности: По мере роста бизнеса и изменения его потребностей может возникнуть необходимость в добавлении новых функций и возможностей в существующее приложение. Развитие позволяет адаптировать приложение под текущие требования.</listLine><listLine>Исправление ошибок и уязвимостей: В процессе эксплуатации приложения могут выявляться ошибки и уязвимости, которые необходимо оперативно устранять. Это помогает обеспечить стабильную и безопасную работу приложения.</listLine><listLine>Интеграция с новыми системами: В процессе развития бизнеса может потребоваться интеграция существующего приложения с новыми системами и сервисами. Доработка позволяет обеспечить бесшовное взаимодействие между различными компонентами инфраструктуры.</listLine><listLine>Повышение производительности: Оптимизация кода и улучшение архитектуры приложения способствуют повышению его производительности, что важно для обеспечения быстрого и плавного пользовательского опыта.</listLine></list>"
          }
        },
        "Аутстаффинг": {
          "SENIOR ROR РАЗРАБОТЧИК (ROR, PostgreSQL, MySQL, Vue|js)": {
            "description": "Лидирует в проектах, строит архитектуру; Принимает ключевые технические решения; Обеспечивает наставничество, исследует новые технологии",
            "price": "75 за час",
            "fullDescription": "<mainTitle>Senior разработчик</mainTitle><paragraph>Опытный разработчик с глубокими знаниями и многолетним опытом работы с Ruby on Rails.</paragraph><listTitle>Чем занимается:</listTitle><listCircle><listLine>Разработка и оптимизация сложных функциональных модулей и компонентов: Создание ключевых функциональных частей приложения, улучшение существующего кода для повышения производительности.</listLine><listLine>Решение архитектурных задач и выбор технологий для проекта: Определение структуры и технологии проекта, чтобы обеспечить его масштабируемость и гибкость.</listLine><listLine>Наставничество и обучение младших разработчиков: Обучение и поддержка менее опытных членов команды, помощь им в развитии.</listLine><listLine>Код-ревью и обеспечение высокого качества кода: Просмотр и анализ кода, написанного другими разработчиками, чтобы убедиться в его качестве и соответствии стандартам.</listLine></listCircle>"
          },
          "Middle разработчик": {
            "description": "Работает самостоятельно, руководство аспектами проекта; Решает задачи, оптимизирует процессы; Наставляет младших разработчиков",
            "price": "55 за час",
            "fullDescription": "<mainTitle>Middle разработчик</mainTitle><paragraph>Разработчик с хорошими знаниями и опытом работы с Ruby on Rails, способный самостоятельно решать большинство задач.</paragraph><listTitle>Чем занимается:</listTitle><listCircle><listLine>Разработка функциональных модулей и компонентов: Создание функциональных частей приложения, таких как интерфейсы пользователей и серверная логика.</listLine><listLine>Внесение улучшений и исправление ошибок: Оптимизация кода и исправление багов, чтобы улучшить работу приложения.Внесение улучшений и исправление ошибок: Оптимизация кода и исправление багов, чтобы улучшить работу приложения.</listLine><listLine>Участие в код-ревью и тестировании: Проверка кода других разработчиков и тестирование собственного кода для обеспечения его качества.</listLine><listLine>Взаимодействие с командой для реализации проекта: Сотрудничество с другими разработчиками и специалистами для успешного выполнения проекта.</listLine></listCircle>"
          },
          "Junior+ разработчик": {
            "description": "Выполняет задачи под руководством; Участвует в обучении и разработке; Пишет код, устраняет баги",
            "price": "35 за час",
            "fullDescription": "<mainTitle>Junior+ разработчик</mainTitle><paragraph>Начинающий разработчик с базовыми знаниями Ruby on Rails, готовый к обучению и развитию.</paragraph><listTitle>Чем занимается:</listTitle><listCircle><listLine>Выполнение простых задач под руководством более опытных коллег: Реализация простых функций и исправление небольших ошибок под присмотром старших разработчиков.</listLine><listLine>Написание и тестирование кода: Создание кода для небольших задач и проведение тестирования для обеспечения его работоспособности.</listLine><listLine>Исправление багов и мелкие улучшения: Устранение простых ошибок и внесение небольших улучшений в приложение.</listLine><listLine>Изучение новых технологий и практик: Постоянное обучение новым технологиям и методологиям разработки.</listLine></listCircle>"
          },
          "Технический директор": {
            "description": "Разрабатывает и реализует стратегические технические планы компании; Внедряет новые технологии для поддержания конкурентоспособности продуктов; Руководит инженерными командами",
            "price": "130 за час",
            "fullDescription": "<mainTitle>Технический директор</mainTitle><paragraph>Руководитель технической части проекта с обширным опытом и стратегическим видением.</paragraph><listTitle>Чем занимается:</listTitle><listCircle><listLine>Разработка технической стратегии и архитектуры проекта: Определение общей технической стратегии проекта и его архитектуры для достижения долгосрочных целей.</listLine><listLine>Руководство командой разработчиков: Организация и координация работы команды разработчиков.</listLine><listLine>Контроль качества кода и соответствие стандартам: Обеспечение соблюдения всех стандартов качества и лучших практик разработки.</listLine><listLine>Принятие ключевых технических решений: Принятие стратегических решений, которые влияют на техническое направление проекта.</listLine></listCircle>"
          },
          "Project Manager": {
            "description": "Разрабатывает детальные планы проекта, учитывая ресурсы, сроки и бюджет; Управляет командами для достижения целей; Обеспечивает соблюдение сроков и бюджетных ограничений, минимизирует риски",
            "price": "80 за час",
            "fullDescription": "<mainTitle>Project Manager</mainTitle><paragraph>Специалист по управлению проектами, отвечающий за планирование и координацию работы команды.</paragraph><listTitle>Чем занимается:</listTitle><listCircle><listLine>Планирование и контроль выполнения задач: Создание и управление планами проекта, контроль сроков и этапов выполнения.</listLine><listLine>Координация работы команды и взаимодействие с клиентом: Организация эффективного взаимодействия между членами команды и клиентом.</listLine><listLine>Управление сроками и бюджетом проекта: Обеспечение выполнения проекта в рамках бюджета и установленных сроков.</listLine><listLine>Решение организационных вопросов и проблем: Разрешение любых возникающих проблем и обеспечение бесперебойной работы команды.</listLine></listCircle>"
          },
          "Team lead": {
            "description": "Координирует и поддерживает работу команды; Определяет технические решения и стандарты; Развивает профессиональные навыки команды; Обеспечивает соблюдение процессов разработки и сроков выполнения задач",
            "price": "80 за час",
            "fullDescription": "<mainTitle>Team lead</mainTitle><paragraph>Лидер команды разработчиков, отвечающий за координацию и мотивацию команды.</paragraph><listTitle>Чем занимается:</listTitle><listCircle><listLine>Руководство командой разработчиков: Организация и координация работы команды для достижения общих целей.</listLine><listLine>Разработка и внедрение лучших практик и стандартов: Обеспечение использования лучших практик разработки и стандартов качества.</listLine><listLine>Помощь в решении технических проблем: Поддержка команды в решении сложных технических задач.</listLine><listLine>Обучение и развитие членов команды: Наставничество и профессиональное развитие членов команды.</listLine></listCircle>"
          },
          "DEVOPS": {
            "description": "Разрабатывает и внедряет автоматизацию; Организует CI/CD для улучшения качества кода и скорости релизов; Настраивает мониторинг производительности",
            "price": "60 за час",
            "fullDescription": "<mainTitle>DEVOPS</mainTitle><paragraph>Специалист по автоматизации и оптимизации процессов разработки и эксплуатации приложений.</paragraph><listTitle>Чем занимается:</listTitle><listCircle><listLine>Настройка и поддержка инфраструктуры проекта: Обеспечение стабильной работы серверов, баз данных и других компонентов инфраструктуры.</listLine><listLine>Автоматизация процессов развертывания и тестирования: Внедрение автоматизированных процессов развертывания и тестирования для повышения эффективности.</listLine><listLine>Обеспечение безопасности и производительности систем: Настройка мер безопасности и оптимизация производительности.</listLine><listLine>Мониторинг и решение проблем эксплуатации: Постоянный мониторинг работы систем и оперативное решение возникающих проблем.</listLine></listCircle>"
          },
          "QA инженер (тестировщик)": {
            "description": "Тестирует продукты для обеспечения соответствия требованиям; Идентифицирует и документирует баги; Разрабатывает тестовые планы и сценарии",
            "price": "35 за час",
            "fullDescription": "<mainTitle>QA инженер (тестировщик)</mainTitle><paragraph>Специалист по тестированию и обеспечению качества программного обеспечения.</paragraph><listTitle>Чем занимается:</listTitle><listCircle><listLine>Разработка и выполнение тестовых сценариев: Создание и выполнение сценариев для проверки функциональности приложения.</listLine><listLine>Автоматизация тестирования: Внедрение автоматизированных тестов для повышения эффективности процесса тестирования.</listLine><listLine>Поиск и документирование багов и ошибок: Обнаружение, документирование и отслеживание багов и ошибок.</listLine><listLine>Взаимодействие с разработчиками для устранения найденных проблем: Совместная работа с разработчиками для исправления найденных проблем.</listLine></listCircle>"
          }
        }
      },
      "from": "от"
    },
    "OurCases": {
      "link": "our-cases",
      "title": "Передовые проекты",
      "description": "Наши проекты — лучшее подтверждение нашей экспертизы",
      "responsiveDescription": "Наши проекты — лучшее<break></break> подтверждение нашей экспертизы",
      "cases": {
        "portal dominion capital": {
          "img": "dominio-cap.png",
          "description": "Комплексная CRM система для оптимизации внутренних процессов организации по предоставлению кредитов в Соединенных Штатах Америки",
          "goal": "Создание комплексной CRM системы для оптимизации внутренних процессов предоставления кредитов в Соединенных Штатах Америки, включая улучшение процессов управления проектами, связанных с созданием и утверждением терминологических листов, а также повышение функциональности и пользовательского опыта для более эффективного управления сделками и кредитными линиями.",
          "fullDescription": "<yellowHeader>Улучшение рабочего процесса сделки:</yellowHeader><whiteHeader>Динамическая выпадающая ссылка:</whiteHeader><break></break><paragraph>Ссылка динамически адаптируется в зависимости от этапа проекта, обеспечивая интуитивную навигацию для пользователей.</paragraph><whiteHeader>Упрощенное создание и утверждение:</whiteHeader><paragraph>Система создает TermSheetApproval, если его еще не существует. Кроме того, процессы утверждения управляются беспрепятственно, обеспечивая прогресс TermSheetApproval только при выполнении необходимых условий.</paragraph><whiteHeader>Управление документами:</whiteHeader><paragraph>Система позволяет загружать и скачивать Term Sheets в различных сценариях, обеспечивая всестороннее хранилище для важных документов.</paragraph><whiteHeader>Улучшенный пользовательский интерфейс:</whiteHeader><paragraph>Интерфейс разработан для облегчения эффективных рабочих процессов. Например, селектор WireInfos доступен при работе с синдикатами, упрощая принятие решений.</paragraph><whiteHeader>Интеграция Stimulus:</whiteHeader><paragraph>Наша система использует мощь контроллеров Stimulus для выполнения определенных действий на разных этапах, улучшая как пользовательский опыт, так и генерацию документов.</paragraph><whiteHeader>Аудиты и уведомления:</whiteHeader><paragraph>Все этапы TermSheetApproval оснащены таблицей аудитов, предоставляя обзор действий. CustomAudits создаются и управляются интеллектуально, информируя заинтересованные стороны.</paragraph><whiteHeader>Рабочий процесс, основанный на ролях:</whiteHeader><paragraph>Роли пользователей играют значительную роль в процессе. Утверждающие и заинтересованные стороны беспрепятственно интегрированы в рабочий процесс, обеспечивая участие нужных людей в нужное время.</paragraph><whiteHeader>Бесшовная интеграция с Slack:</whiteHeader><paragraph>Финальные этапы утверждения включают автоматическую загрузку Term Sheet и отправку в Slack, все управляется через интерфейс системы.</paragraph><yellowMarginHeader>Результат</yellowMarginHeader><paragraph>Посвященность и экспертиза нашей команды привели к успешному завершению задачи №1756 всего за 87 часов и 54 минуты. В процессе было обновлено 64 файла, что привело к впечатляющему преобразованию кодовой базы: +2733 добавления и -819 удаления.</paragraph>",
          "link": ""
        },
        "Portraits of honor": {
          "img": "portraits-of-honor.png",
          "description": "Выжившие в Холокосте из Мичигана - это интерактивная образовательная выставка Программы для выживших в Холокосте и их семей",
          "goal": "Создание интерактивной образовательной выставки, посвященной выжившим в Холокосте из Мичигана, в рамках Программы для выживших в Холокосте и их семей, с целью сохранения исторической памяти, обучения будущих поколений и поддержки выживших и их семей.",
          "fullDescription": "",
          "link": "https://www.portraitsofhonor.org/"
        },
        "Loandox": {
          "img": "loandox.png",
          "description": "CRM-система для Gu Loans,которые предоставляют кредитные услуги для различных типов бизнеса",
          "goal": "Необходимо было доработать уже существующую СРМ-системe для Gu Loans, которая предоставляет кредитные услуги для различных типов бизнеса. К задачам по клиентской части относятся: 1. Разработк HTML-письма, которое клиент получает после того, как оставляет заявку на сайте 2. Разработка формы загрузки документа 3. Разработка модальных окон",
          "fullDescription": "",
          "link": "https://www.behance.net/gallery/154321453/CRM-system-for-GU-Loans"
        },
        "The Oleh Budget Calculator": {
          "img": "calculator.png",
          "description": "Разработка приложения для расчета и анализа стоимости жизни, включая транспортные расходы, с функцией динамической визуализации и интеграцией реальных данных.",
          "fullDescription": "<yellowHeader>Подробная калькуляция стоимости жизни:</yellowHeader><paragraph>Пользователи могут вводить и настраивать различные расходы на жилье, коммунальные услуги, питание, развлечения, здравоохранение и прочее.</paragraph><paragraph>Приложение рассчитывает общую ежемесячную и годовую стоимость жизни на основе введенных данных.</paragraph><paragraph>Поддерживается база данных средних расходов для разных городов Израиля для точных расчетов.</paragraph><whiteHeader>Компонент транспорта:</whiteHeader><paragraph>Отдельная секция для транспортных расходов, включая варианты общественного транспорта, расходы на личный автомобиль</paragraph><paragraph></paragraph><paragraph>Пользователи могут вводить расходы в разных валютах, и приложение автоматически конвертирует их по последнему курсу.</paragraph><paragraph>Интеграция с реальными данными о трафике и ценах на топливо для точного расчета расходов.</paragraph><whiteHeader>Динамическая визуализация:</whiteHeader><paragraph>Подробные диаграммы и графики для визуального представления структуры расходов.</paragraph><paragraph>Интерактивная диаграмма, обновляющаяся в реальном времени по мере изменения данных пользователями.</paragraph><paragraph>Инструменты для сравнения, позволяющие увидеть, как различные изменения влияют на общий бюджет.</paragraph><whiteHeader>Сервис курса валют:</whiteHeader><paragraph>Отдельный сервис для получения и обновления курса валют в режиме реального времени.</paragraph><paragraph>Пользователи могут вводить расходы в разных валютах, и приложение автоматически конвертирует их по последнему курсу.</paragraph><paragraph>Сервис обеспечивает точность и актуальность расчетов стоимости.</paragraph><whiteHeader>Калькуляция в реальном времени:</whiteHeader><paragraph>По мере ввода или изменения расходов пользователями приложение мгновенно пересчитывает общую стоимость жизни и обновляет визуальные диаграммы.</paragraph><paragraph>Мгновенная обратная связь помогает пользователям понимать финансовые последствия своих выборов без задержек.</paragraph>",
          "goal": "Создание калькулятора стоимости жизни в Израиле для переезда с интеграцией реальных цен и баз данных расходов различных городов страны.",
          "link": ""
        }
      },
      "goalText": "Цель",
      "learnMore": "посмотреть весь кейс",
      "goToProject": "перейти к проекту",
      "orderLink": "Заказать проект "
    },
    "RoRAdvantages": {
      "link": "ror-advantages",
      "title": "в чём сила<break></break> Ruby on Rails",
      "advantages": {
        "Быстрота реализации": "Ruby on Rails позволяет нам значительно ускорить процесс разработки и превращать идеи в работающие продукты благодаря наличию готовых решений для многих задач, в сочетании с нашими гибкими методологиями, чтобы запустить ваш проект быстрее, чем когда-либо",
        "Поддержка баз данных": "Поддерживает работу с большинством широко известных систем управления базами данных, таких как MySQL, PostgreSQL и другие, что делает его универсальным решением для разработки",
        "Гибкий исходный код": "Фреймворк предоставляет возможность переработать код под ваши нужды. Гибко настраивается под различные типы приложений, которые необходимы бизнесу"
      }
    },
    "OurApproach": {
      "title": "формируем будущее<break></break> с каждым<breakLg></breakLg> проектом",
      "approaches": {
        "эффективное управление": "Используем систему контроля версий (Git), а также предоставляем по запросу заказчика доступ к нашему репозиторию на платформах GitHub или GitLab",
        "прозрачность работы": "С использованием CI, Capistrano и непрерывного развертывания на staging-сервере, вы всегда в курсе процесса разработки вашего проекта",
        "покрытие кода проектов": "Обеспечиваем полное покрытие кода наших проектов автоматическими тестами с использованием Rspec, Capybara и Factorybot",
        "мониторинг и оптимизация": "Осуществляем мониторинг и исправление ошибок при помощи Sentry, выполняем мониторинг и оптимизацию производительности с использованием New Relic"
      }
    },
    "AboutUs": {
      "link": "about-us",
      "title": "Наш диджитал<breakMobile></breakMobile> мир",
      "description": "Future Markt – digital агентство, берущее своё начало в 2011 году. Мы создаём децентрализованные приложения и интерфейсы к ним, разрабатываем UX/UI дизайны и маркетинговые стратегии для продвижения проектов в сети.",
      "responsiveDescription": "Future Markt – digital агентство, <span>берущее свое начало в 2011 году. <break></break>Мы создаем децентрализованные приложения и интерфейсы к ним, разрабатываем UX/<break></break>UI дизайны и маркетинговые стратегии для продвижения проектов в сети.</span>",
      "advantages": {
        "15 лет с ruby on rails": "С 2009 года мы активно разрабатываем проекты на Ruby on Rails, непрерывно расширяя наш опыт и экспертизу",
        "58 проектов c ror": "Мы накопили весомый опыт в разработке веб-приложений, чтобы запустить ваш проект с минимумом рисков и ошибок",
        "сложные задачи - легко": "Решаем задачи любой сложности:  разработка API, разработка крупных веб-приложений, интеграция с внешними системами и другие"
      },
      "haveIdea": "У вас есть идея?",
      "sayToUs": "Расскажите о ней нам, мы <break></break>воплотим ее на Ruby on Rails",
      "contactOnTG": "Связаться через Телеграм:",
      "contacts": {
        "Ярослав": {
          "post": "CMO",
          "link": "https://t.me/yarkoch"
        },
        "Виталий": {
          "post": "product manager",
          "link": "https://t.me/vitkoz"
        }
      }
    },
    "OtherServices": {
      "title": "Другие наши услуги",
      "services": {
        "Разработка web-3 проектов": {
          "desc": "Разработка DeFi, Dao, dApp, Smart Contracts, Эдвайзеринг и консалтинг, разработка токена/крпитовалюты",
          "link": "https://web3.futuremarkt.com/"
        },
        "Веб-дизайн": {
          "desc": "Разработка landing page, интернет-магазина, корпоративного сайта,брендбука, Ux/Ui интерфейса",
          "link": ""
        }
      },
      "knowMore": "Узнать подробнее"
    },
    "WeInMedia": {
      "link": "we-in-media",
      "title": "Мы в медиа",
      "articles": {
        "Мощный фреймворк для создания API на Ruby": {
          "img": "grape",
          "description": "Если вы занимаетесь разработкой веб-приложений или API, вы, вероятно, слышали о Grape — мощном фреймворке на языке программирования Ruby",
          "link": "https://teletype.in/@yegordv/WBkP1wGDHoc"
        },
        "Разработка чат-ботов с использованием Ruby": {
          "img": "robot",
          "description": "Ruby делает разработку чат-ботов быстрой и простой. В этой статье мы рассмотрим преимущества Ruby для разработки чат-ботов с примерами кода",
          "link": "https://tproger.ru/articles/razrabotka-chat-botov-s-ispolzovaniem-ruby"
        }
      },
      "bannerTitleImg": "railshub",
      "bannerDescripImg": "Телеграм канал по ruby on rails",
      "bannerTitle": "Телеграм канал по ruby on rails - railshub",
      "bannerDescrip": "Также наши сотрудники активно ведут экспертную деятельность в телеграме",
      "videoLink": "#",
      "readMore": "Читать полностью"
    },
    "HaveQuestions": {
      "title": "Остались вопросы?",
      "leaveReq": "Оставляйте заявку или напишите нам в Telegram, наши специалисты свяжутся с вами и ответят на любой ваш вопрос",
      "writeTGBtn": "написать в телеграм",
      "leaveReqLink": "оставить заявку"
    },
    "Footer": {
      "digitalAgency": "digital agency",
      "copyright": "© Фьюче Маркт",
      "legalEntityInfo": "Информация о юридическом лице",
      "privacy": "Политика конфиденциальности",
      "forAllQuestions": "По всем вопросам:",
      "@yarkoch": "8 (999) 136-68-38",
      "rights": "All rights reserved",
      "upBtn": "Наверх",
      "addresses": {
        "+7 999 136 6838": "Россия, Нижний Новгород, Родионова 192В",
        "+972 54 9965034": "Israel 90435, Zeit Shemen St 2 Efrat",
        "+1 414 212 5484": "United States of America, 1366 E Sumner St #1008, Hartford WI 53027"
      }
    }
  }
}
